{"id":1059,"date":"2016-11-18T07:28:25","date_gmt":"2016-11-18T12:28:25","guid":{"rendered":"http:\/\/4writers.net\/blog\/?p=1059"},"modified":"2016-11-28T04:40:42","modified_gmt":"2016-11-28T09:40:42","slug":"writing-can-be-fun-tips-to-boost-your-desire-to-write","status":"publish","type":"post","link":"https:\/\/4writers.net\/blog\/writing-can-be-fun-tips-to-boost-your-desire-to-write\/","title":{"rendered":"Writing Can Be Fun: Tips to Boost Your Desire to Write"},"content":{"rendered":"<p style=\"text-align: justify;\">Whenever one comes to a decision to start writing, there comes a challenge of defining whether one is capable of doing this kind of job and turning it from a hobby into a full-time employment. I believe this is absolutely possible; however, there is a need to define what motivates us to write and what drives our decisions. Therefore, I would like to share the tips for boosting your writing motivation.<!--more--><\/p>\n<h3><img loading=\"lazy\" class=\"aligncenter wp-image-1060\" src=\"http:\/\/4writers.net\/blog\/wp-content\/uploads\/2016\/11\/4writers_Writing-Can-Be-Fun-Tips-to-Boost-Your-Desire-to-Write-1024x714.jpeg\" alt=\"4writers_writing-can-be-fun-tips-to-boost-your-desire-to-write\" width=\"800\" height=\"558\" srcset=\"https:\/\/4writers.net\/blog\/wp-content\/uploads\/2016\/11\/4writers_Writing-Can-Be-Fun-Tips-to-Boost-Your-Desire-to-Write-1024x714.jpeg 1024w, https:\/\/4writers.net\/blog\/wp-content\/uploads\/2016\/11\/4writers_Writing-Can-Be-Fun-Tips-to-Boost-Your-Desire-to-Write-300x209.jpeg 300w, https:\/\/4writers.net\/blog\/wp-content\/uploads\/2016\/11\/4writers_Writing-Can-Be-Fun-Tips-to-Boost-Your-Desire-to-Write-768x535.jpeg 768w, https:\/\/4writers.net\/blog\/wp-content\/uploads\/2016\/11\/4writers_Writing-Can-Be-Fun-Tips-to-Boost-Your-Desire-to-Write-275x192.jpeg 275w, https:\/\/4writers.net\/blog\/wp-content\/uploads\/2016\/11\/4writers_Writing-Can-Be-Fun-Tips-to-Boost-Your-Desire-to-Write.jpeg 1400w\" sizes=\"(max-width: 800px) 100vw, 800px\" \/><\/h3>\n<h3 style=\"text-align: justify;\">Have  the right attitude<\/h3>\n<p style=\"text-align: justify;\">Primarily, we should consider writing as something that brings us fun and joy. In the opposite case, i.e. when one takes it as purely as a job, it is impossible to feel satisfaction from writing. Unfortunately, many beginning writers initially consider writing as a job, not a way to spend time with joy and fun. This is the major reason why before anybody starts writing, he or she should think about it as a way to spend time in a useful manner and with a positive approach. Otherwise, it would be impossible to fully relax and have fun while writing. This is why every writer should remember that as long as he or she considers writing as a job, they would not be able to relax and enjoy while completing their job.<\/p>\n<h3 style=\"text-align: justify;\">Take a break<\/h3>\n<p style=\"text-align: justify;\">Next, remember to take a break between writing numerous essays. Although some experienced writers may say they can work 24\/7, long-lasting continuous work will never lead anyone to success. Every work has to be followed with some decent rest. In other words, whether you like it or not, find some time for relaxation and entertainment, and this is how you will be able to keep up working for hours or even for days without a big break. Since writing as a job takes a part of part life, we have to find the alternatives that would allow us to spend some time out of it, leaving the job behind.<\/p>\n<h3 style=\"text-align: justify;\">Feel proud<\/h3>\n<p style=\"text-align: justify;\">Third advice you will receive may seem somewhat strange, yet this may change your life significantly. Start thinking of writing as of some masterpiece you create every time you engage in the writing process. In other words, make sure you are the first person to realize how important your writing is. This would enable you to share your views and ideas with others. This is crucial in both short-term and long-term perspectives, as such positive approach and capability of feeling proud of your work will lead to other people seeing you the same way. In such case, when both yourself and other people would be perceiving you this way, you will be always happy to keep on writing and sharing joy and happiness with the people surrounding you.<\/p>\n<h3 style=\"text-align: justify;\">Make friends with other writers<\/h3>\n<p style=\"text-align: justify;\">Last, yet definitely not the least important tip on how you may boost your writing is by making friends with other writers, or suggesting your current friends to become writers. Even though writing is individual, you should not forget that sometimes ideas mysteriously skip your mind, and it might turn literally impossible to come up with the great idea for writing on demand. This is a perfect case when the friends may come to rescue you from the approaching disaster by dropping in some fresh thoughts and ideas that were omitting you somehow. Also, talking about writing with friends may shed some new light on the issues in writing you may face from time to time. Therefore, it is important to have friends who are writers as well, so that in any tough situation you would have someone to reply on and the person who would support you in making a complex decision.<\/p>\n<p style=\"text-align: justify;\">Following these easy and simple tips, it will be extremely simple to be always tuned into writing and remain focused on it. Thus never stop writing and creating new masterpieces.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Whenever one comes to a decision to start writing, there comes a challenge of defining whether one is capable of doing this kind of job and turning it from a hobby into a full-time employment. I believe this is absolutely possible; however, there is a need to define what motivates us to write and what&#8230;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[2,4,6],"tags":[53,54,29],"_links":{"self":[{"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/posts\/1059"}],"collection":[{"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/comments?post=1059"}],"version-history":[{"count":2,"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/posts\/1059\/revisions"}],"predecessor-version":[{"id":1076,"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/posts\/1059\/revisions\/1076"}],"wp:attachment":[{"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/media?parent=1059"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/categories?post=1059"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/tags?post=1059"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}