{"id":1062,"date":"2017-05-31T04:15:20","date_gmt":"2017-05-31T09:15:20","guid":{"rendered":"http:\/\/4writers.net\/blog\/?p=1062"},"modified":"2017-05-15T01:20:25","modified_gmt":"2017-05-15T06:20:25","slug":"how-to-write-an-annotated-bibliography","status":"publish","type":"post","link":"https:\/\/4writers.net\/blog\/how-to-write-an-annotated-bibliography\/","title":{"rendered":"How to Write an Annotated Bibliography?"},"content":{"rendered":"<p style=\"text-align: justify;\">Students have to write a lot of annotated bibliographies during studies, so it becomes quite an important type of paper to learn about. If you’re still wondering what an annotated bibliography is and what it includes, this post is for you. If you should do some research project, this article will also help you prepare for it. An annotated bibliography is a list of sources that are needed to explore some topic. It gives a brief summary of every source and evaluates its significance. Here is what you should do to write it properly.<!--more--><\/p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-1063\" src=\"http:\/\/4writers.net\/blog\/wp-content\/uploads\/2016\/11\/4writers_How-to-Write-an-Annotated-Bibliography.jpg\" alt=\"4writers_how-to-write-an-annotated-bibliography\" width=\"800\" height=\"600\" srcset=\"https:\/\/4writers.net\/blog\/wp-content\/uploads\/2016\/11\/4writers_How-to-Write-an-Annotated-Bibliography.jpg 800w, https:\/\/4writers.net\/blog\/wp-content\/uploads\/2016\/11\/4writers_How-to-Write-an-Annotated-Bibliography-300x225.jpg 300w, https:\/\/4writers.net\/blog\/wp-content\/uploads\/2016\/11\/4writers_How-to-Write-an-Annotated-Bibliography-768x576.jpg 768w, https:\/\/4writers.net\/blog\/wp-content\/uploads\/2016\/11\/4writers_How-to-Write-an-Annotated-Bibliography-267x200.jpg 267w\" sizes=\"(max-width: 800px) 100vw, 800px\" \/><\/p>\n<h3 style=\"text-align: justify;\">Define its purpose<\/h3>\n<p style=\"text-align: justify;\">An annotated bibliography can be an independent project as well as just a part of research, so you should definitely know the type of assignment to define its purpose. An annotated bibliography may discover and organize sources for future study, identify sources of interest, illustrate the scope of available sources, reveal the depth and quality of what you’ve read, or conduct a literature review on the subject. As you see, there is a great variety to choose from.<\/p>\n<h3 style=\"text-align: justify;\">Select the source<\/h3>\n<p style=\"text-align: justify;\">Once the bibliography’s purpose is defined, you should choose appropriate sources for it. It’s quite easy to do. Setting research limits, it is just essential to take the following questions into account:<\/p>\n<ul style=\"text-align: justify;\">\n<li>What is the problem\/topic of investigation? You must determine the purpose of your literature research.<\/li>\n<li>What are the materials of study (e.g., primary historical data, government reports, journal articles, academic books)? You should make sure that all of them refer to your assignment theme and requirements.<\/li>\n<li>Is it possible to find the necessary research on your topic? You have to analyze whether there are valuable sources, using keywords for searching.<\/li>\n<\/ul>\n<h3 style=\"text-align: justify;\"> Summarize the argument<\/h3>\n<p style=\"text-align: justify;\">Citation and annotation are two components of an annotated bibliography entry. Being one paragraph in length (100-300 words), an annotation summarizes the source’s key argument. You should remember that recognizing the argument differs from listing or describing the contents. An annotation rather explains them. So, to summarize the argument, it is necessary to find the central claim, namely the thesis, key ideas and terms throughout the text, the methods and theories of investigation, and the organization of main sections or divisions.<\/p>\n<h3 style=\"text-align: justify;\">Assess value and relevance<\/h3>\n<p style=\"text-align: justify;\">In addition to summarizing the argument, you must assess the source’s value and relevance within your annotation. Students have to note how and for what purpose they plan to use the source if the annotated bibliography is a part of the project. And if it is an independent task, you should evaluate how the source contributes to your investigation. For example, does it propose new ways\/methods of the issue; how good is the evidence; are there any limitations, etc. Everything depends on the context.<\/p>\n<h3 style=\"text-align: justify;\">Choose the correct format<\/h3>\n<p style=\"text-align: justify;\">Here we’ve come to citation as the first part of an annotated bibliography entry. It is put before annotation and requires sources to be organized in alphabetical order, usually by the last name of the first author. The citation’s first line starts at the left side, whereas subsequent lines should be indented. Moreover, it is needed to format the citation according to a certain academic style, so you should check with your professor which style is preferable to use. APA, MLA, and Chicago are the most common citation styles requested at universities. Both within citations and between them, the annotated bibliography is double-spaced.<\/p>\n<p style=\"text-align: justify;\">To cut a long story short, an annotated bibliography has the citation that comes first and the annotation that follows it. The annotation is the biggest part that reviews the source’s key argument and evaluates its value and relevance. It can present goals and methods, scope and effectiveness, conclusions and limitations. But the most important is to explain how the source highlights the theme or conforms to the project.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Students have to write a lot of annotated bibliographies during studies, so it becomes quite an important type of paper to learn about. If you’re still wondering what an annotated bibliography is and what it includes, this post is for you. If you should do some research project, this article will also help you prepare&#8230;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[7],"tags":[55,58,57,56],"_links":{"self":[{"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/posts\/1062"}],"collection":[{"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/comments?post=1062"}],"version-history":[{"count":2,"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/posts\/1062\/revisions"}],"predecessor-version":[{"id":1075,"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/posts\/1062\/revisions\/1075"}],"wp:attachment":[{"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/media?parent=1062"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/categories?post=1062"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/tags?post=1062"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}