{"id":1084,"date":"2016-12-09T10:04:42","date_gmt":"2016-12-09T15:04:42","guid":{"rendered":"http:\/\/4writers.net\/blog\/?p=1084"},"modified":"2017-03-29T03:28:06","modified_gmt":"2017-03-29T08:28:06","slug":"how-to-learn-academic-citation-styles-quickly","status":"publish","type":"post","link":"https:\/\/4writers.net\/blog\/how-to-learn-academic-citation-styles-quickly\/","title":{"rendered":"How to Learn Academic Citation Styles Quickly"},"content":{"rendered":"<p>Every academic paper should have a citation style that structures and formats it according to a certain guide. Usually, the academic discipline defines which style is preferred. For instance, MLA style is commonly used for the humanities and liberal arts, and papers for social sciences are mainly formatted in APA style. Still, a student should always consult with the instructor to get to know which style is requested in this particular course. With so many citation styles, it’s good to learn the basic principles they are built on.<!--more--><\/p>\n<p><img loading=\"lazy\" class=\"size-full wp-image-1085\" src=\"http:\/\/4writers.net\/blog\/wp-content\/uploads\/2016\/12\/4writers_How-to-Learn-Academic-Citation-Styles-Quickly.jpg\" alt=\"\" width=\"800\" height=\"600\" srcset=\"https:\/\/4writers.net\/blog\/wp-content\/uploads\/2016\/12\/4writers_How-to-Learn-Academic-Citation-Styles-Quickly.jpg 800w, https:\/\/4writers.net\/blog\/wp-content\/uploads\/2016\/12\/4writers_How-to-Learn-Academic-Citation-Styles-Quickly-300x225.jpg 300w, https:\/\/4writers.net\/blog\/wp-content\/uploads\/2016\/12\/4writers_How-to-Learn-Academic-Citation-Styles-Quickly-768x576.jpg 768w, https:\/\/4writers.net\/blog\/wp-content\/uploads\/2016\/12\/4writers_How-to-Learn-Academic-Citation-Styles-Quickly-267x200.jpg 267w\" sizes=\"(max-width: 800px) 100vw, 800px\" \/><\/p>\n<h3>General Guidelines<\/h3>\n<ul>\n<li><strong>Page Header.<\/strong> It’s provided at the top of each page with a page number inserted on the right. APA style also requires the running head in the header that’s a capitalized shortened version of the title flush left. The words “Running head” are indicated on the first page only. In MLA style, the student’s last name and page number must be mentioned on every page, without any change.<\/li>\n<li><strong>Text Alignment.<\/strong> The text is aligned to the left side.<\/li>\n<li><strong>Spacing.<\/strong> Papers are usually double-spaced with no additional intervals, comprising figures, tables, references, and appendices if there’re any.<\/li>\n<li><strong>Font Type and Size.<\/strong> 12-pt., Times New Roman is a recommended font throughout the academic paper.<\/li>\n<li><strong>Margin.<\/strong> The academic paper is to be measured with one inch on all sides.<\/li>\n<\/ul>\n<h3>Title Page<\/h3>\n<p>Every style has a clear example of how the first page, namely title page, should look like. The title page in APA style includes the paper’s title, student’s\/author’s name, and institutional affiliation. This information is to be given in the center of the page. On the contrary, MLA style doesn’t demand students to make a cover page, but the first page, where the academic paper begins, must contain the student’s name, professor’s name, course number, and due date inserted on the left. Thus, it’s important to know how to structure the title page properly.<\/p>\n<h3>In-Text Citations<\/h3>\n<p>To avoid plagiarism, the academic paper should have in-text citations that take place at the end of the sentence but before the period. The last name(s) of the author(s) and publication date are two items that are always present in APA citations, and they should match sources in references. The number of the page appears only when it is a direct quote. MLA style follows the author-page technique for citations within the text. It means that last name(s) of the author(s) and the page number(s) must occur in the text, no matter it’s a paraphrase or direct quotation.  Short quotations are put in quotation marks, and long quotations should be placed in a free-standing block. Sometimes, MLA and Chicago styles require using footnotes or endnotes instead of in-text citations. Footnotes are placed below the main text, whereas endnotes are presented on a separate page before works cited\/bibliography.<\/p>\n<h3>Tables and Figures<\/h3>\n<p>Doing some research, students often include visual elements, such as tables and figures, to add value to the project. Presenting statistical results or quantitative data, the table is labeled as Table with the number and with the title on the next line. Below the caption, the table itself is placed flush-left. All illustrations, such as graphs, charts, diagrams, or maps, are labeled as Fig.\/Figure, numbered, and titled below the visual display. One should not forget to cite the source if the table or figure is taken from it.<\/p>\n<h3>References<\/h3>\n<p>The reference section should contain all sources earlier cited in the academic paper’s body. When there are no appendices, it becomes the last page. Its title differs according to the citation style: it is named as References in APA style, Works Cited in MLA style, Bibliography in Chicago, etc. Reference list entries have to be placed in alphabetical order by the author’s last name or the work’s title when the author is unknown. Every style usually requires such source information as the name(s) of the author(s), publication date, work’s title, and electronic information retrieval. Actually, all print and electronic sources have diverse guidelines, so it’s necessary to follow them precisely.<\/p>\n<p>While writing an academic paper, citation styles help students be ethical and get good marks. To learn them quickly, one should consider the main points: the title page, in-text citations, tables and figures, and reference section. APA and MLA are the most popular styles in institutions, so it’s essential to learn their principles of formatting.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Every academic paper should have a citation style that structures and formats it according to a certain guide. Usually, the academic discipline defines which style is preferred. For instance, MLA style is commonly used for the humanities and liberal arts, and papers for social sciences are mainly formatted in APA style. Still, a student should&#8230;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[7],"tags":[68,69,67,70],"_links":{"self":[{"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/posts\/1084"}],"collection":[{"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/comments?post=1084"}],"version-history":[{"count":2,"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/posts\/1084\/revisions"}],"predecessor-version":[{"id":1087,"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/posts\/1084\/revisions\/1087"}],"wp:attachment":[{"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/media?parent=1084"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/categories?post=1084"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/tags?post=1084"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}