{"id":1116,"date":"2017-01-18T09:21:49","date_gmt":"2017-01-18T14:21:49","guid":{"rendered":"http:\/\/4writers.net\/blog\/?p=1116"},"modified":"2017-01-26T04:40:33","modified_gmt":"2017-01-26T09:40:33","slug":"how-to-avoid-a-burnout-if-you-write-much","status":"publish","type":"post","link":"https:\/\/4writers.net\/blog\/how-to-avoid-a-burnout-if-you-write-much\/","title":{"rendered":"How to Avoid a Burnout if You Write Much"},"content":{"rendered":"<p>If you dedicate much time to something and like it, it is great. Still, everything should be properly timed and measured. If one does something too often he\/she might feel exhausted and start hating it. You have probably encountered similar situation at least once in your life. It is called a burnout. <!--more-->We aren’t prepared to it as a rule. If, for example, you write much for fun or writing is something you do on a daily basis to earn money, you are not 100% protected from a burnout. And once you’ve experienced it, it’s very hard to come back to normal state of things when you like what you do and do not want to crash your laptop against the wall. So, what should you do? Change occupation? Give up everything and start travelling? And what if you need money and cannot quit? Look for someone to replace you? The solution is miles easier – arrange your life in such a way to avoid writer’s burnout. Here you can find some tips that will help you do it.<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-1117\" src=\"http:\/\/4writers.net\/blog\/wp-content\/uploads\/2017\/01\/4writers_How-to-Avoid-a-Burnout-if-You-Write-Much.jpg\" alt=\"4writers_How to Avoid a Burnout if You Write Much\" width=\"800\" height=\"600\" srcset=\"https:\/\/4writers.net\/blog\/wp-content\/uploads\/2017\/01\/4writers_How-to-Avoid-a-Burnout-if-You-Write-Much.jpg 800w, https:\/\/4writers.net\/blog\/wp-content\/uploads\/2017\/01\/4writers_How-to-Avoid-a-Burnout-if-You-Write-Much-300x225.jpg 300w, https:\/\/4writers.net\/blog\/wp-content\/uploads\/2017\/01\/4writers_How-to-Avoid-a-Burnout-if-You-Write-Much-768x576.jpg 768w, https:\/\/4writers.net\/blog\/wp-content\/uploads\/2017\/01\/4writers_How-to-Avoid-a-Burnout-if-You-Write-Much-267x200.jpg 267w\" sizes=\"(max-width: 800px) 100vw, 800px\" \/><\/p>\n<h3>1. Set your goal<\/h3>\n<p>It’s better to have some plans in everything you do, especially if it refers to your job. Once a week make plans as to writing. Decide how much you are going to write – 3, 10 or 30 pages. If possible, choose the tasks you are going to complete and understand what you need for that. You can also make a list of writing tasks in terms of importance or deadline to know which one you need to do first.<\/p>\n<h3>2. Do it on a regular basis<\/h3>\n<p>Even though it might sound ridiculous in this situation, you need to write at least something every day to avoid a writing burnout. If you write essays, blogs, or different papers to make money, you need to have really good writing skills. Despite the fact that it is a “low season” in your job and you do not have much work, you need to devote a little time to it every day. If you do something on a regular basis, you improve your abilities and when the tough time comes, you are ready. Thus, switch the TV of for the next 30 minutes and write something.<\/p>\n<h3>3. Get rid of distractors<\/h3>\n<p>Most people like doing several things at a time. It might be the best option if you are a busy mama with 3 kids who needs to do laundry, cook, take care of babies, and clean the house right this instant. However, real life shows that only mothers and superman have such powers to perform multiple tasks at the same time with great results. Ordinary people do not usually possess such abilities. So, if you are not a superman, concentrate on doing one thing at a time. If you need to complete the order, do not get distracted by watching TV, talking to a friend, cleaning, or anything else. Choose the time you can devote to your occupation only and your productivity will get miles higher.<\/p>\n<h3>4. Choose the themes<\/h3>\n<p>If you are a professional writer, you can produce articles about almost everything. Still, we all have our preferences. For this reason, if possible, devote some part of your working time to writing about the aspects you like. Adore literature or nursing? Go ahead and take at least one order a week that focuses on these subjects. It will help you earn money and enjoy what you do.<\/p>\n<h3>5. Empty stomach<\/h3>\n<p>Do not start writing if you have just had your lunch. Believe me: that feeling of sleepy satisfaction and slow movements will not contribute to your productivity. It’s better to walk for a while till your stomach does at least half of its job. It will take an hour or two.<\/p>\n<h3>6. Take rest<\/h3>\n<p>We need to rest from everything we do. If you write a lot, make sure you devote several hours a day to having rest. It’s better to choose the time you will devote to writing papers and create a fixed working schedule even though you have a flexible one. Hours remaining should not be related to writing in any way: you need to switch your PC off, put the book away and stop thinking about writing ideas. Have a walk, talk to a friend or do anything that will help your eyes, back and mind get rest.<\/p>\n<p>Thus, in order to have a good productivity and keep on enjoying writing, you need to protect yourself from writer’s burnout. In order to do that, you need to set a goal, write on a regular basis, and get rid of distractions. Choosing the topics to write about, getting rest and having a break in writing if you have just eaten will help you as well.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>If you dedicate much time to something and like it, it is great. Still, everything should be properly timed and measured. If one does something too often he\/she might feel exhausted and start hating it. You have probably encountered similar situation at least once in your life. It is called a burnout.<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[2,4,7],"tags":[90,88,89,87,91],"_links":{"self":[{"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/posts\/1116"}],"collection":[{"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/comments?post=1116"}],"version-history":[{"count":1,"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/posts\/1116\/revisions"}],"predecessor-version":[{"id":1118,"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/posts\/1116\/revisions\/1118"}],"wp:attachment":[{"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/media?parent=1116"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/categories?post=1116"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/tags?post=1116"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}