{"id":1187,"date":"2017-08-11T01:03:21","date_gmt":"2017-08-11T06:03:21","guid":{"rendered":"https:\/\/4writers.net\/blog\/?p=1187"},"modified":"2017-08-08T01:29:10","modified_gmt":"2017-08-08T06:29:10","slug":"advice-on-how-to-proofread-the-work-you-have-written","status":"publish","type":"post","link":"https:\/\/4writers.net\/blog\/advice-on-how-to-proofread-the-work-you-have-written\/","title":{"rendered":"Advice on How to Proofread the Work You Have Written"},"content":{"rendered":"<p>Everyone proofreads or, at least, is supposed to proofread their written works irrespective of the status or competence. Before submitting the final version of any written assignment, you re-read it to make sure you do not have any errors. Still, being edited by any “third party”, the work turns out to contain some mistakes. The explanation is easy: reading your own work, you fail to notice a certain number of mistakes while someone else reading the same texts is sure to find some more.<br \/>\n<!--more--><\/p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-1188\" src=\"https:\/\/4writers.net\/blog\/wp-content\/uploads\/2017\/08\/4writers_Advice-on-How-to-Proofread-the-Work_rewritten.jpg\" alt=\"dvice on How to Proofread the Work\" width=\"800\" height=\"600\" srcset=\"https:\/\/4writers.net\/blog\/wp-content\/uploads\/2017\/08\/4writers_Advice-on-How-to-Proofread-the-Work_rewritten.jpg 800w, https:\/\/4writers.net\/blog\/wp-content\/uploads\/2017\/08\/4writers_Advice-on-How-to-Proofread-the-Work_rewritten-300x225.jpg 300w, https:\/\/4writers.net\/blog\/wp-content\/uploads\/2017\/08\/4writers_Advice-on-How-to-Proofread-the-Work_rewritten-768x576.jpg 768w, https:\/\/4writers.net\/blog\/wp-content\/uploads\/2017\/08\/4writers_Advice-on-How-to-Proofread-the-Work_rewritten-267x200.jpg 267w\" sizes=\"(max-width: 800px) 100vw, 800px\" \/><\/p>\n<p>So, find below <strong>five tips on how to proofread the work you have written:<\/strong><\/p>\n<ol>\n<li><strong> Get the scenery changed.<\/strong> A perfect tool for editing is WordPress, which has a kind of function enabling a writer to edit the work. It works perfectly well with the documents in Word or PowerPoint Presentations. In case of the written work being a release, it is a good idea to make the screen size larger – not less than 20 %. In order to proofread a document in PowerPoint, you had better have it printed, as proofreading printed notes is far more efficient.<\/li>\n<li><strong> Be aware of your weak points.<\/strong> While typing the text, you may fall into a trap of your own brain work and fingers&#8217; agility. Sometimes, your fingers fall behind the thoughts you are going to expose in the text and try hard to keep up with them making too many slips of the tongue or the finger, to be precise. To avoid this, editing needs to be done slowly and attentively, preferably using a printed version of the document.<\/li>\n<li><strong> Read from the end. <\/strong>It sounds strange, but it works. While the work you have written is being edited, the meaning and syntax are inferred. Thus, if you read only words, these are only words you edit. While reading the assignment from the end, you will consider the spelling and punctuation with more objectivity.<\/li>\n<li><strong> Take your time. <\/strong>Do not be in a hurry and take breaks from time to time. Having finished writing, stop for a while. Take a walk or have some tea before getting down to editing. It will help your brain to readjust to the new form of work, which is explained by the fact that in the process of writing your brain looks ahead anticipating the finish and overlooking some points. Editing after a short break allows you to look at the text from the “fresh” angle, ensuring an error-free final product.<\/li>\n<li><strong> Do not read silently.<\/strong> Reading a piece of writing aloud enables you to perceive the words as the words, actually, but not as the carriers of meaning attributed to them. Reading the text aloud is a good method of getting concentrated, as you swap the roles with the readers of your writing, which is not a bad idea eventually.<\/li>\n<\/ol>\n<p>Following the above tips, you will find yourself proofreading without any difficulties, leaving editors with no work to do with your writing.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Everyone proofreads or, at least, is supposed to proofread their written works irrespective of the status or competence. Before submitting the final version of any written assignment, you re-read it to make sure you do not have any errors. Still, being edited by any “third party”, the work turns out to contain some mistakes. The&#8230;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[4,7],"tags":[117,116,24],"_links":{"self":[{"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/posts\/1187"}],"collection":[{"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/comments?post=1187"}],"version-history":[{"count":3,"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/posts\/1187\/revisions"}],"predecessor-version":[{"id":1191,"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/posts\/1187\/revisions\/1191"}],"wp:attachment":[{"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/media?parent=1187"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/categories?post=1187"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/tags?post=1187"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}