{"id":1630,"date":"2018-10-31T22:43:00","date_gmt":"2018-11-01T03:43:00","guid":{"rendered":"https:\/\/4writers.net\/blog\/?p=1630"},"modified":"2018-11-01T04:48:59","modified_gmt":"2018-11-01T09:48:59","slug":"handy-tips-on-how-to-write-an-argumentative-essay","status":"publish","type":"post","link":"https:\/\/4writers.net\/blog\/handy-tips-on-how-to-write-an-argumentative-essay\/","title":{"rendered":"Handy Tips on How to Write an Argumentative Essay"},"content":{"rendered":"<p>An argumentative essay is a typical assignment, which college students have to deal with while pursuing their academic careers. Although there are various types of an argumentative essay, the bedrock is the same: <strong>the writer must research a problem, take a stance on it and dig up as much evidence as possible to back up the overall claim.<\/strong><!--more--><\/p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-1634\" src=\"https:\/\/4writers.net\/blog\/wp-content\/uploads\/2018\/11\/2What-skills-are-required-for-academic-writing_800x600.jpg\" alt=\"\" width=\"800\" height=\"600\" srcset=\"https:\/\/4writers.net\/blog\/wp-content\/uploads\/2018\/11\/2What-skills-are-required-for-academic-writing_800x600.jpg 800w, https:\/\/4writers.net\/blog\/wp-content\/uploads\/2018\/11\/2What-skills-are-required-for-academic-writing_800x600-300x225.jpg 300w, https:\/\/4writers.net\/blog\/wp-content\/uploads\/2018\/11\/2What-skills-are-required-for-academic-writing_800x600-768x576.jpg 768w, https:\/\/4writers.net\/blog\/wp-content\/uploads\/2018\/11\/2What-skills-are-required-for-academic-writing_800x600-267x200.jpg 267w\" sizes=\"(max-width: 800px) 100vw, 800px\" \/><\/p>\n<p>To write a well-structured and good-quality argumentative essay, consider the following steps:<\/p>\n<ul>\n<li><strong>Create a thesis, which is clear and suitable for a debate.<\/strong> An efficient thesis statement is an indispensable element of an argument essay, as readers must understand what the argument is and why it is significant.<\/li>\n<li><strong>Give the necessary insight into the topic<\/strong>. An argument essay considerably differs from a research essay, in which readers are knowledgeable about a subject. For this reason, the background information cannot be neglected since readers must understand the nature of an argument. For instance, if the writer puts forward an argument that the constitution of a certain state should be amended, it is necessary to explain what changes the amendment would imply and whether or not a similar amendment has been under consideration earlier.<\/li>\n<li><strong>Pay special attention to organization and transitions<\/strong>. The transitions are of utmost importance in an argument essay, as it is based on reasons and factual data, which back up the thesis. The essay should also include counter arguments, which are discussed and refuted as well.<\/li>\n<\/ul>\n<p>Argumentative essays can have different forms of organization. Irrespective of the order, in which they are organized, all argumentative essays must not only support and provide an explanation of a few reasons why the argument is sound but also explain and refute a few opposing arguments presented by the opposite side. Drawing an outline will be particularly helpful and beneficial, especially in the case of long argumentative essays.<\/p>\n<ul>\n<li><strong>Conduct painstaking research<\/strong>. To include the research is one of the requirements of most argumentative essays.  Thus, make sure you have done enough research before you start writing. It is crucial since you must know whether there are enough reliable sources to incorporate in your essay. Definitely, you do not want to start writing and then find out that your sources do not suffice to make your essay plausible and trustworthy.<\/li>\n<li><strong>Incorporate means of persuasion, such as logos, pathos, and ethos<\/strong>. Logos stands for the use of logic in an argument. It is fundamental in writing and should be traced throughout the whole essay, as it is the best way to persuade people to take a certain stance on the issue. While logos is a bedrock of an argumentative essay, pathos &#8211; which is the use of emotions &#8211; can also be applied. Pathos implies an emotional involvement of the reader in an argument so that he\/she is open to further persuasion. Ethos &#8211; the use of credibility &#8211; is not less significant. It can be applied by presenting counterarguments and using reliable sources. Adopting a sensible stance on the issue will add credibility as well.<\/li>\n<\/ul>\n<p><strong>Topic selection<\/strong><\/p>\n<p>Choosing a topic is an essential part of composing an argumentative essay. The writer must opt for a topic that resonates with the society and has logical arguments. Besides, an argumentative essay topic should be <strong>current, arguable, manageable and researchable<\/strong>.<\/p>\n<p>A <strong>current topic<\/strong> is the one, which has been debated for centuries and is still relevant to our society.<\/p>\n<p>An <strong>arguable<\/strong> <strong>topic<\/strong> is the one, which can have various interpretations. We cannot consider debatable writing about child abuse ramifications for society, as no one would claim otherwise. However, arguing whether the common punishments for a child are efficient in averting crime is debatable.<\/p>\n<p>A <strong>manageable topic<\/strong> is the one, which is possible to cover not exceeding the required length of the essay. Such issues as national or global problems cannot be adequately researched in several pages. Thus, writers should start with a basic subject and then narrow it down. One can opt for discussing a certain law or act. However, it is impossible to argue for or against the entire law (the bill itself is too long). Thus, it is advisable to narrow this subject down and argue for or against one part of the law.<\/p>\n<p>A <strong>researchable topic<\/strong> means that one can find lots of reliable and relevant sources to support it.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>An argumentative essay is a typical assignment, which college students have to deal with while pursuing their academic careers. Although there are various types of an argumentative essay, the bedrock is the same: the writer must research a problem, take a stance on it and dig up as much evidence as possible to back up&#8230;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[7],"tags":[111,34,186],"_links":{"self":[{"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/posts\/1630"}],"collection":[{"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/comments?post=1630"}],"version-history":[{"count":2,"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/posts\/1630\/revisions"}],"predecessor-version":[{"id":1902,"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/posts\/1630\/revisions\/1902"}],"wp:attachment":[{"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/media?parent=1630"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/categories?post=1630"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/tags?post=1630"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}