{"id":2278,"date":"2020-11-30T03:05:35","date_gmt":"2020-11-30T08:05:35","guid":{"rendered":"https:\/\/4writers.net\/blog\/?p=2278"},"modified":"2020-11-30T03:05:35","modified_gmt":"2020-11-30T08:05:35","slug":"avoiding-bias-in-writing-essentials","status":"publish","type":"post","link":"https:\/\/4writers.net\/blog\/avoiding-bias-in-writing-essentials\/","title":{"rendered":"Avoiding Bias in Writing: Essentials"},"content":{"rendered":"<p>It may be extremely complicated to avoid being biased while writing. It is worth noting that bias is defined as an inclination or tendency for a person to hold a specific outlook or take peculiar judgments concerning any topic. Thus, how are you capable of recognizing bias and what should be done to avoid it in your own writing? We would like to focus on the general principles on composing about different people as well as their personal traits without bias. <!--more--><\/p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-2282\" src=\"https:\/\/4writers.net\/blog\/wp-content\/uploads\/2020\/11\/bias-free.jpg\" alt=\"\" width=\"800\" height=\"533\" srcset=\"https:\/\/4writers.net\/blog\/wp-content\/uploads\/2020\/11\/bias-free.jpg 800w, https:\/\/4writers.net\/blog\/wp-content\/uploads\/2020\/11\/bias-free-300x200.jpg 300w, https:\/\/4writers.net\/blog\/wp-content\/uploads\/2020\/11\/bias-free-768x512.jpg 768w, https:\/\/4writers.net\/blog\/wp-content\/uploads\/2020\/11\/bias-free-275x183.jpg 275w\" sizes=\"(max-width: 800px) 100vw, 800px\" \/><\/p>\n<p><strong>Specific Emphasis on Relevant and Important Characteristics<\/strong><\/p>\n<p>It is recommended to be mindful and reasonable in describing or presenting only relevant and specific characteristics. Though it is possible to indicate or dwell on a person’s disability, age, gender identity, racial, ethnic, cultural or religious identity, participation in research, socioeconomic status, sexual orientation, or other features or traits without bias, it is not always needed to include all this info in your work or project. For a more thorough discussion of participants’ characteristics to dwell on in your works, refer to the journal article reporting standards for <a href=\"https:\/\/apastyle.apa.org\/jars\/qualitative\">qualitative or <u>quantitative <\/u>studies<\/a>. For instance, you would be unlikely to indicate sexual orientation of the participants in the study devoted to cognition as this aspect is irrelevant to cognition. However, you would prefer to state gender of the participants in the study on stereotype threats as gender is closely relegated to the examination and explication of stereotype threats. Furthermore, there can be multiple relevant features to discuss or focus on in your research; whenever this is the case, you should try to address all the ways in which these characteristics under analysis <a href=\"https:\/\/apastyle.apa.org\/style-grammar-guidelines\/bias-free-language\/intersectionality\">intersect<\/a>, as needed.<\/p>\n<p><strong>Indicate Relevant and Key Differences that Are Evident<\/strong><\/p>\n<p>Writing without bias implies not only recognizing essential differences that ought to be mentioned only whenever relevant but also making specific emphasis on relevant and significant differences in case they are obvious. Try evaluating the meaning of the terms “<em>difference<\/em>” in reference to the target group, not the dominant one. For instance, the researcher who aims to generalize the research results to people or students in general is to assess and report on whether the sample under study differs from the target group and, if so, indicate how it is different.<\/p>\n<p><strong>Try to Be Specific, Clear and Precise<\/strong><\/p>\n<p>After you have established which essential characteristics you are going to highlight, choose scientific terms. Consider that the choice of the terms depends on the research question(s) and the current state of knowledge in a specific field. Avoid mentioning characteristics or traits gratuitously. However, whenever in doubt, try to be more specific and reasonable rather than less, as it is simpler to aggregate the data available than to disaggregate it. Take into consideration the appropriate and sound level of specificity in the research process in advance – such as while designing the research – as it may be impossible to collect more data once the research is underway or completed. Utilizing specific terms can improve the readers&#8217; ability to comprehend the generalizability of the research findings indicated by you and other researchers&#8217; ability to apply your data in the future meta-analysis or further replication.<\/p>\n<p><strong>Vivid Examples of Specificity Based on Topics<\/strong><\/p>\n<p>We provide examples of the specific language use for the topics presented in the following bias-free language guideline; as indicated earlier, the proper choice usually depends on the situation, and our examples illustrate just some of the options possible.<\/p>\n<p>Whenever composing on <a href=\"https:\/\/apastyle.apa.org\/style-grammar-guidelines\/bias-free-language\/age\"><strong>age<\/strong><\/a>, age ranges or ages (e.g. 20–25 years old, 60–85 years old) are considered more specific and clear than broad ones (e.g. over 20 years old, over 60 years old). Moreover, indicate the age mean and median besides mentioning the range of ages so as to increase the specificity of your project.<\/p>\n<p>Whenever writing about <a href=\"https:\/\/apastyle.apa.org\/style-grammar-guidelines\/bias-free-language\/disability\"><strong>disability<\/strong><\/a>, the names of specific conditions or syndromes (e.g. Alzheimer&#8217;s disease or Lucey–Driscoll syndrome) are considered more specific than other categories of conditions or states (e.g. types of dementia) or generally applied references, including  such as “disabled people”.<\/p>\n<p>Whenever writing on <a href=\"https:\/\/apastyle.apa.org\/style-grammar-guidelines\/bias-free-language\/gender\"><strong>gender identity<\/strong><\/a>, it is recommended to use descriptors with modifiers (e.g. trans-gender woman or cisgender woman), which are considered more specific than average descriptors without any modifiers (e.g. woman) or general non-gendered terms (e.g. people, person, individual, individuals, population, etc.). Refer to the bias-free language for <a href=\"https:\/\/apastyle.apa.org\/style-grammar-guidelines\/bias-free-language\/gender\">gender<\/a> as well as for how to differentiate between sex and gender).<\/p>\n<p>Whenever writing on <a href=\"https:\/\/apastyle.apa.org\/style-grammar-guidelines\/bias-free-language\/research-participation\"><strong>people that participated in research<\/strong><\/a>, the terms indicating the context of the study (e.g. patients, customer, clients, participants, respondents, etc.) are more specific than generally used terms (e.g. children, people, women, men, or human).<\/p>\n<p>Whenever writing on <a href=\"https:\/\/apastyle.apa.org\/style-grammar-guidelines\/bias-free-language\/racial-ethnic-minorities\"><strong>racial, ethnic or minority groups<\/strong><\/a>, the region or nation of origin (e.g. Mexican Americans, Chinese Americans, African Americans, Japanese Americans) is more specific than the generalized name or origin (e.g. Latin Americans, Asian Americans).<\/p>\n<p>Whenever writing on <a href=\"https:\/\/apastyle.apa.org\/style-grammar-guidelines\/bias-free-language\/socioeconomic-status\"><strong>socioeconomic status<\/strong><\/a>, the income ranges or certain designations (e.g. below the state poverty threshold for the family of five) are more specific than the generalized labels (e.g. low or high income).<\/p>\n","protected":false},"excerpt":{"rendered":"<p>It may be extremely complicated to avoid being biased while writing. It is worth noting that bias is defined as an inclination or tendency for a person to hold a specific outlook or take peculiar judgments concerning any topic. Thus, how are you capable of recognizing bias and what should be done to avoid it&#8230;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[7],"tags":[262,266,270],"_links":{"self":[{"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/posts\/2278"}],"collection":[{"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/comments?post=2278"}],"version-history":[{"count":1,"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/posts\/2278\/revisions"}],"predecessor-version":[{"id":2286,"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/posts\/2278\/revisions\/2286"}],"wp:attachment":[{"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/media?parent=2278"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/categories?post=2278"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/tags?post=2278"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}