{"id":2382,"date":"2021-02-12T12:07:24","date_gmt":"2021-02-12T17:07:24","guid":{"rendered":"https:\/\/4writers.net\/blog\/?p=2382"},"modified":"2021-02-12T12:09:09","modified_gmt":"2021-02-12T17:09:09","slug":"the-difference-between-the-active-and-passive-voice","status":"publish","type":"post","link":"https:\/\/4writers.net\/blog\/the-difference-between-the-active-and-passive-voice\/","title":{"rendered":"The Difference between the Active and Passive Voice"},"content":{"rendered":"<p>The choice of active or passive voice in your writing is highly related to the writing style and the message you want to convey. In some cases, the chosen voice may help you emphasize some idea in your sentence. If you doubt whether to use the active or passive voice, read this article <!--more-->and you will definitely get more comprehensive understanding of why the active voice should be used in formal language and research writing, when the passive voice is more preferable, and which voice is the most suitable in academic writing.<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-2386\" src=\"https:\/\/4writers.net\/blog\/wp-content\/uploads\/2021\/02\/Untitled.jpg\" alt=\"\" width=\"800\" height=\"499\" srcset=\"https:\/\/4writers.net\/blog\/wp-content\/uploads\/2021\/02\/Untitled.jpg 800w, https:\/\/4writers.net\/blog\/wp-content\/uploads\/2021\/02\/Untitled-300x187.jpg 300w, https:\/\/4writers.net\/blog\/wp-content\/uploads\/2021\/02\/Untitled-768x479.jpg 768w, https:\/\/4writers.net\/blog\/wp-content\/uploads\/2021\/02\/Untitled-275x172.jpg 275w\" sizes=\"(max-width: 800px) 100vw, 800px\" \/><\/p>\n<p>It was perfectly normal earlier to use the passive voice even in research writing. It helped to maintain impersonal and unbiased tone of writing, and thus make it more objective. Even now, many people consider the passive voice to add more formality to the messages. For many years, writers and especially academic writers were recommended using the passive voice when presenting results of their studies. Using the active voice, especially pronouns “I,” “my,” “we,” “our,” etc., was considered to be too personal. Nonetheless, the passive structures are definitely more wordy and sometimes more confusing in terms of communicating ideas across. When you use long sentences, the passive voice may play a trick on you. In short, that is the reason why academic writing experts have the standardized active voice for research writing. They have done it with the core aim of making scientific papers easier to read and comprehend.<\/p>\n<h3 style=\"text-align: center;\"><strong>Why You Should Prefer the<\/strong> <strong>Active Voice<\/strong><\/h3>\n<ol>\n<li><strong> It makes your text more readable.<\/strong><\/li>\n<\/ol>\n<p>If you take a look at some academic writing manuals such as the AMA (the American Medical Association) and the APA (the American Psychological Association), you will notice they recommend using active voice particularly because it ensures clear, direct, and succinct expression of ideas in a written manner. Resultantly, your text becomes more legible and easier to understand.<\/p>\n<p>Take a look at the following sentences and compare them in terms of readability:<\/p>\n<p>The passive voice: <em>The firmness acceleration reaction was considerably impacted by the high indenter mass.<\/em><\/p>\n<p>The active voice: <em>High indenter mass considerably impacted the firmness acceleration reaction.<\/em><\/p>\n<ol start=\"2\">\n<li><strong> It emphasizes the writer’s responsibility.<\/strong><\/li>\n<\/ol>\n<p>When a person uses the active voice, he\/she brings more authorship to the statements and arguments he\/she puts forward. When a person predominantly uses the passive voice, it may be unclear to the readers who did a specific action. Look at the following examples:<\/p>\n<p>The passive voice: <em>No actions were done to investigate the crime thoroughly.<\/em><\/p>\n<p>The active voice: <em>We did not do any particular actions to investigate the crime thoroughly.<\/em><\/p>\n<p>It is evident that the active voice is more relevant when you want to focus on a specific decision and persons who made it.<\/p>\n<ol start=\"3\">\n<li><strong> The active voice is more popularly used in journals.<\/strong><\/li>\n<\/ol>\n<p>If the research article or dissertation will be published in a scientific journal, keep in mind that you are required to ensure appropriate writing style. As such, the active voice is more preferable. Readers will find it easier to comprehend the main message or idea of your findings. Some of the other advantages of using the active voice are direct, concise, and logical utterances.<\/p>\n<h3 style=\"text-align: center;\"><strong>When You Should Prefer the Passive Voice<\/strong><\/h3>\n<ol>\n<li><strong> When you place the focus on the recipient.<\/strong><\/li>\n<\/ol>\n<p>When you want to emphasize the object or person under influence or something acted on. Look:<\/p>\n<p>The active voice: <em>In 1920s, scientists from Toronto University first found out insulin. It still remains the only possible cure for diabetes.<\/em><\/p>\n<p>The passive voice: <em>Insulin was first fount out in the 1920s by scientists from Toronto University. It still remains the only possible cure for diabetes.<\/em><\/p>\n<p>When you compare both of the abovementioned sentences, you will notice that insulin is in the center of discussion. The point is not in the person who discovered it, but in the very fact of its discovery.<\/p>\n<ol start=\"2\">\n<li><strong> When the action is more significant than the actor is.<\/strong><\/li>\n<\/ol>\n<p>When you describe scientific experiments, for example, it is more important to focus on what was done and how instead of who has done it. Look:<\/p>\n<p>The active voice: <em>First, I heated the substance to 110°C for around 15 minutes and then cooled it down.<\/em><\/p>\n<p>The passive voice: <em>The substance was first heated up to around 110°C and was then cooled down.<\/em><\/p>\n<p>In the second option, where the passive voice is chosen, the focus is on actual experiment but not on the person who did it.<\/p>\n<ol start=\"3\">\n<li><strong> To eliminate repetitions in content.<\/strong><\/li>\n<\/ol>\n<p>The passive voice usage can bring more variety to your sentences and the whole text. You will also avoid <a href=\"https:\/\/owl.purdue.edu\/owl\/general_writing\/academic_writing\/conciseness\/avoid_common_pitfalls.html\">repetition<\/a> of the same words and phrases. Check it out:<\/p>\n<p>The active voice: <em>The researcher dissolved sodium chloride in water. Then he neutralized the substance with hydrochloric acid. <\/em><\/p>\n<p>The passive voice: <em>Sodium chloride was dissolved in water and then neutralized with the help of hydrochloric acid. <\/em><\/p>\n<h3 style=\"text-align: center;\"><strong>The <\/strong><strong>Active and Passive Voice Usage in Different Parts of Academic Writing <\/strong><\/h3>\n<p>Now we suggest that you explore a little bit deeper in which chapters we recommend utilizing the active voice and which are better off with passive.<\/p>\n<p><strong><em>The<\/em><\/strong> <em><strong>Active Voice:<\/strong><\/em><\/p>\n<ol>\n<li>Introductory chapter and discussion section. The active voice in these chapters is particularly helpful when it comes to describing the main ideas, clarifying what you will do in the research, etc. When it comes to the discussion chapter, you pinpoint what you have researched, established, etc.<\/li>\n<li>Review of literature. The aim of this chapter is to emphasize the most important findings and contributions made by other researchers in the field. As such, agents, i.e. researchers and scholars, are essential to mention here.<\/li>\n<\/ol>\n<p><strong><em>The<\/em><\/strong> <em><strong>Passive Voice:<\/strong><\/em><\/p>\n<ol>\n<li>Methodology chapter. In this case, the passive voice is better as you focus on the steps and strategies taken instead of emphasizing the actor.<\/li>\n<li>Results chapter. When describing and analyzing results, one should be objective, so the passive voice helps to fulfill this aim without being <a href=\"https:\/\/4writers.net\/blog\/avoiding-bias-in-writing-essentials\/\">biased<\/a>.<\/li>\n<\/ol>\n<p>To sum up, the active and passive voice alike can be used in research and academic writing. Both of them can be appropriate depending on the purpose and the message you intend to convey.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The choice of active or passive voice in your writing is highly related to the writing style and the message you want to convey. In some cases, the chosen voice may help you emphasize some idea in your sentence. If you doubt whether to use the active or passive voice, read this article<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[7],"tags":[334,326,330],"_links":{"self":[{"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/posts\/2382"}],"collection":[{"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/comments?post=2382"}],"version-history":[{"count":1,"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/posts\/2382\/revisions"}],"predecessor-version":[{"id":2390,"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/posts\/2382\/revisions\/2390"}],"wp:attachment":[{"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/media?parent=2382"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/categories?post=2382"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/tags?post=2382"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}