{"id":2406,"date":"2021-02-27T14:39:04","date_gmt":"2021-02-27T19:39:04","guid":{"rendered":"https:\/\/4writers.net\/blog\/?p=2406"},"modified":"2021-07-26T06:22:37","modified_gmt":"2021-07-26T11:22:37","slug":"effective-use-of-common-tenses-in-academic-writing","status":"publish","type":"post","link":"https:\/\/4writers.net\/blog\/effective-use-of-common-tenses-in-academic-writing\/","title":{"rendered":"Effective Use of Common Tenses in Academic Writing"},"content":{"rendered":"<p>Verb tenses allow the reader to figure out when a particular event takes place. What is more, when it comes to academic writing, the usage of tenses usually goes beyond chronology representation. The choice of tenses enables the reader to understand the degree of generality intended as well as the author’s attitude towards the theory or idea being reported.<!--more--><\/p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-2410\" src=\"https:\/\/4writers.net\/blog\/wp-content\/uploads\/2021\/02\/Tenses2.jpg\" alt=\"\" width=\"800\" height=\"500\" srcset=\"https:\/\/4writers.net\/blog\/wp-content\/uploads\/2021\/02\/Tenses2.jpg 800w, https:\/\/4writers.net\/blog\/wp-content\/uploads\/2021\/02\/Tenses2-300x188.jpg 300w, https:\/\/4writers.net\/blog\/wp-content\/uploads\/2021\/02\/Tenses2-768x480.jpg 768w, https:\/\/4writers.net\/blog\/wp-content\/uploads\/2021\/02\/Tenses2-275x172.jpg 275w\" sizes=\"(max-width: 800px) 100vw, 800px\" \/><\/p>\n<p>In academic writing, three main tenses make up approximately 98% of verbs used in academic writing. Present simple is used more often than other tenses. In addition, writers often use present perfect and past simple. These tenses can be used either in the <a href=\"https:\/\/4writers.net\/blog\/the-difference-between-the-active-and-passive-voice\/\">passive or active voice<\/a>. Below, you will find the key functions performed by these tenses in academic writing.<\/p>\n<h4 style=\"text-align: center;\"><strong>Present Simple<\/strong><\/h4>\n<p>This tense is the most popular in academic writing as it is used “by default” unless one needs to use another tense (when the sentence includes a marker of past time). As for the specific ways of using the present simple tense, one should mention the following:<\/p>\n<p>1. To frame a paper. This tense is often used in introductions to familiarize the reader with what is already known about the topic. Also, it can be used in a conclusion to help the reader figure out what is known now.<\/p>\n<p>For example:<\/p>\n<p><em>Scholars believe that the global warming issues should be solved on the governmental level.<\/em><\/p>\n<p>2. To point out the aims and the key argument of the paper:<\/p>\n<p>For example:<\/p>\n<p><em>This paper analyzes the influence of high temperatures on glaciers.<\/em><\/p>\n<p>3. To make general interpretations, statements, and conclusions about findings of previous or current research.<\/p>\n<p>For example:<\/p>\n<p><em>High school is regarded as crucial for choosing a career because students get interested in many areas. The students have to understand what career path they want to undertake.<\/em><\/p>\n<p>4. To refer to the findings of previous scholars without indicating the authors’ names:<\/p>\n<p>For example:<\/p>\n<p><em> Children sleep about 10-12 hours per day.<\/em><\/p>\n<p>5. To refer to graphs or tables.<\/p>\n<p>For example:<\/p>\n<p><em>Table III presents the distinctive features of two issues.<\/em><\/p>\n<p>6. To describe the plot or events in a literary work:<\/p>\n<p>For example:<\/p>\n<p><em>In Shelly’s “Frankenstein,” a scientist creates a monster, but it turns out that the real monster is the creator.<\/em><\/p>\n<h4 style=\"text-align: center;\"><strong>Past Simple<\/strong><\/h4>\n<p>This tense is used to tell what actions happened in the past. Among the functions this tense performs are:<\/p>\n<p>1. To familiarize the reader with the findings of earlier studies. Typically, the author’s name is included.<\/p>\n<p>For example:<\/p>\n<p><em>In music cognition, the most popular phenomenon is the Mozart Effect. Raucher and other researchers first mentioned this effect in their study.<\/em><\/p>\n<p>2. To describe the methods of data from the experiment that was already completed.<\/p>\n<p>For example:<\/p>\n<p><em>The data was used to define relationships between variables.<\/em><\/p>\n<p>3. To familiarize the reader with the results of the current study.<\/p>\n<p>For example:<\/p>\n<p><em>We noticed a significant influence of this effect, though it was not as positive as we opined first. <\/em><\/p>\n<p>4. After any marker of past time.<\/p>\n<p>For example:<\/p>\n<p><em>After World War II, Japan has faced significant problems with economics.<\/em><\/p>\n<h4 style=\"text-align: center;\"><strong>Present Perfect<\/strong><\/h4>\n<p>The present perfect tense is widely used when one needs to mention previous findings indicating the data that is relevant today. In academic writing, this tense performs the following functions:<\/p>\n<p>1. To introduce a new topic. Also, it can be used to introduce a new paper or report.<\/p>\n<p>For example:<\/p>\n<p><em>There has been much work regarding the negative effect of carbon emissions on global warming problems.<\/em><\/p>\n<p>2. To summarize previous research with rather general findings. The present perfect tense emphasizes what has been done or what is known to be true.<\/p>\n<p>For example:<\/p>\n<p><em>Some studies have established that women are still underpaid in most the developed states. <\/em><\/p>\n<p>3. To mention a gap in the existing research. In other words, it helps build a connection between the past and the present.<\/p>\n<p>For example:<\/p>\n<p><em>Whereas this news has proven to be trustworthy and valid, there is little data on how they relate to the subject of the discussion.<\/em><\/p>\n<p>4. To describe previous findings without mentioning the source directly:<\/p>\n<p>For example:<\/p>\n<p><em>It has been proved that nursing is the most popular and rewarding career.<\/em><\/p>\n<h4 style=\"text-align: center;\"><strong>A Few Words about Other Tenses<\/strong><\/h4>\n<p>Whereas the three tenses mentioned above are the most popular and widely used in academic writing, there are some cases when one may need to use other tenses to make distinctions between the times.<\/p>\n<h5><span style=\"font-size: 12pt;\"><strong>Future Simple<\/strong><\/span><\/h5>\n<p>This tense is often used for stating one’s intentions or making predictions. For example, you are free to use it in your thesis proposal to explain what you are going to do. Also, it is used for stating hypotheses. However, you should avoid using this tense when there is a high level of certainty. In particular, you will need to use verbs like expect, predict, etc. making rather cautious statements.<\/p>\n<p>For example:<\/p>\n<ul>\n<li><em>There will be a strong correlation between the two variables. – Wrong.<\/em><\/li>\n<li><em>We expect to get a strong correlation between the two variables. – Right.<\/em><\/li>\n<li><em>The data obtained allow producing a strong correlation between the two variables. – Right.<\/em><\/li>\n<\/ul>\n<p>Also, when discussing the future implications of your research, try to use modal verbs that assume possibility (may, might, can, could).<\/p>\n<p>For example:<\/p>\n<ul>\n<li><em>This data will affect future approaches to the subject. – Wrong.<\/em><\/li>\n<li><em>This data could affect future approaches to the subject. – Right.<\/em><\/li>\n<\/ul>\n<h5><span style=\"font-size: 12pt;\"><strong>Present, Past, and Future Continuous<\/strong><\/span><\/h5>\n<p>Although the continuous aspect is not widely used in academic writing, it is necessary to know how to use it properly. The continuous aspect usually implies an informal tone (though in most cases, the present perfect or the present simple are more appropriate).<\/p>\n<p>For example:<\/p>\n<ul>\n<li><em>Some researchers are suggesting that the data about carbon dioxide emissions are no longer accurate.<\/em><\/li>\n<li><em>Some researchers suggest that the data about carbon dioxide emissions are no longer accurate.<\/em><\/li>\n<li><em>Some researchers have suggested that the data about carbon dioxide emissions are no longer accurate.<\/em><\/li>\n<\/ul>\n<p>Nevertheless, sometimes, the continuous aspect can be used in some descriptions. It is widely utilized for telling about events related to each other:<\/p>\n<p>For example:<\/p>\n<ul>\n<li><em>While Leslie is traveling to London, she meets many people, who will become her good friends.<\/em><\/li>\n<li><em>The country was recovering from the disaster when a new earthquake has occurred.<\/em><\/li>\n<\/ul>\n<h5><span style=\"font-size: 12pt;\"><strong>Past Perfect<\/strong><\/span><\/h5>\n<p>As well as the previous tenses, the past perfect tense is not widely utilized, except for disciplines that require making distinctions between various aspects in the past.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Verb tenses allow the reader to figure out when a particular event takes place. What is more, when it comes to academic writing, the usage of tenses usually goes beyond chronology representation. The choice of tenses enables the reader to understand the degree of generality intended as well as the author’s attitude towards the theory&#8230;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[7],"tags":[346,350,342,338],"_links":{"self":[{"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/posts\/2406"}],"collection":[{"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/comments?post=2406"}],"version-history":[{"count":4,"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/posts\/2406\/revisions"}],"predecessor-version":[{"id":2670,"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/posts\/2406\/revisions\/2670"}],"wp:attachment":[{"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/media?parent=2406"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/categories?post=2406"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/tags?post=2406"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}