{"id":2522,"date":"2021-05-17T12:03:42","date_gmt":"2021-05-17T17:03:42","guid":{"rendered":"https:\/\/4writers.net\/blog\/?p=2522"},"modified":"2021-06-03T04:36:18","modified_gmt":"2021-06-03T09:36:18","slug":"how-to-choose-the-best-sources-for-your-paper","status":"publish","type":"post","link":"https:\/\/4writers.net\/blog\/how-to-choose-the-best-sources-for-your-paper\/","title":{"rendered":"How to Choose the Best Sources for Your Paper"},"content":{"rendered":"<p>When it comes to writing academic papers, it is important to use the most reliable sources. It will help you convince your audience that your arguments are valid and accurate. However, you should understand that using sources that lack credibility will significantly reduce your chances of getting a good grade. Therefore, if you want to succeed in academic writing, you should clearly understand the difference between credible and not credible academic sources.<\/p>\n<p><!--more--><\/p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-2526\" src=\"https:\/\/4writers.net\/blog\/wp-content\/uploads\/2021\/05\/CREDIBLE-SOURCES.jpg\" alt=\"\" width=\"800\" height=\"533\" srcset=\"https:\/\/4writers.net\/blog\/wp-content\/uploads\/2021\/05\/CREDIBLE-SOURCES.jpg 800w, https:\/\/4writers.net\/blog\/wp-content\/uploads\/2021\/05\/CREDIBLE-SOURCES-300x200.jpg 300w, https:\/\/4writers.net\/blog\/wp-content\/uploads\/2021\/05\/CREDIBLE-SOURCES-768x512.jpg 768w, https:\/\/4writers.net\/blog\/wp-content\/uploads\/2021\/05\/CREDIBLE-SOURCES-275x183.jpg 275w\" sizes=\"(max-width: 800px) 100vw, 800px\" \/><\/p>\n<p>Of course, no matter what the topic of your paper is, you will find tons of materials on the web. Your task as a researcher is to recognize which data is maximally accurate and feasible. The ability to recognize accurate facts from fake information is a basic skill that should be familiar to any researcher. So, if you want to master a professional approach to work, you need to follow the tips outlined below. The guide will provide you with handy guidelines that will help you choose the best sources for your papers. To select the best sources, it is necessary to:<\/p>\n<ul>\n<li>Be skeptical. You should understand that even if something is presented as a fact, it does not mean that it truth. Therefore, we highly recommend you question all the facts, insights, and ideas you will find in books, articles, or websites. Only if you manage to find solid evidence supporting this fact, you can use it in your paper;<\/li>\n<li>Examine the credentials of the author. To understand whether the source is credible, you will need to understand who is its author. If the author does not have sufficient expertise and background in the topic they are addressing, his or her words will lack credibility. Therefore, when studying a particular source, you should focus on not only its content but also the writer. If the writer is biased or not objective in what he\/she is claiming, it is better to choose another source;<\/li>\n<li>Check the sources that were used by the author. When studying some scholarly article, you will need to check the bibliography that can be found at the end of the article. Only if these sources are valid and credible, you can use this source in your own work;<\/li>\n<li>Make sure your sources are up-to-date. Using outdated sources is the main mistake of many writers. Well, you should understand that the information that is located in the sources written many years ago is no longer credible, especially if you are working with the field that is constantly developing;<\/li>\n<li>Check the reviews of the source you are using. You should accept the fact that you can overlook some flaws of the source you are using. Therefore, it is highly recommended to have a look at what other reputed scholars say about the source you are using. If they confirm that the author is knowledgeable enough and his or her arguments are credible, you can use this source for writing your paper;<\/li>\n<li>Make sure the publisher is reputable. If the source is published by the company having a doubtful reputation, we highly recommend you change it into a more credible one. This rule is of use when you have to use peer-reviewed academic journals. You should understand that you cannot consider a personal blog a reliable source of information. You may reasonably ask, “Can I use websites as the sources for my papers?” Well, yes, you are free to use them. However, you need to be sure that the authors are maximally unbiased and <a href=\"https:\/\/4writers.net\/blog\/objective-writing-professional-guidelines-and-tips\/\">objective<\/a>;<\/li>\n<li>Make sure the source includes no vague or shallow information. When you manage to acquire advanced research skills, you will find it easier to understand which academic sources are credible and which ones are not. A very helpful tip on how to choose an appropriate source is to double-check if it contains no shallow information. If you find the data that is pretty vague, you should better use another source. The peer-reviewed articles usually include no shallow ideas because they are cross-checked by reputed scholars.<\/li>\n<\/ul>\n<p>We assure you that by following our handy tips, you will be able to pick up the best sources for your paper.<\/p>\n<h4 style=\"text-align: center;\"><strong>Common Types of Sources That Can Be Used in Your Paper<\/strong><\/h4>\n<ul>\n<li>Credible websites. Nowadays, writers prefer to look for information online, as the Internet is riddled with various sources of information. No doubt, this way is easy and effortless because it allows getting the necessary information for your paper without even leaving your room. At the same time, you need to be maximally careful when working with online websites because not all of them are reliable. If you need to use some encyclopedia or other related websites, you need to double-check whether it is appropriate according to instructions;<\/li>\n<li>Journal articles. One more source that writers frequently use is a journal article. Being rather short, they may include all the necessary data that can help you back up your ideas. Needless to say, all the <a href=\"https:\/\/www.snhu.edu\/about-us\/newsroom\/2020\/03\/what-is-a-scholarly-source\">scholarly articles<\/a> you will use for your paper should be peer-reviewed, up-to-date, and fact-based. You may use the following services to find appropriate articles: Oxford Academic, Google Scholar, Cornell University Library, EBSCOhost, and many others. Pay attention that when working with an academic article, you will need to consider its purpose, accuracy, relevance, and authority. If you fail to choose a good article for your paper, you will lose many points;<\/li>\n<li>Credible news sources. Not all news sources are reliable. However, it is acceptable to use the articles you will find in The Washington Post, The New York Times, and similar newspapers.<\/li>\n<\/ul>\n<p>The ability to understand the differences between credible sources and not credible ones will help you grow into a skilled researcher.<\/p>\n<h4 style=\"text-align: center;\"><strong>What Sources Are Peer-Reviewed<\/strong><\/h4>\n<p>Whereas all peer-viewed sources are scholarly, not all scholarly sources are peer-reviewed.<\/p>\n<p>Peer reviewing means that reputed scholars critiqued and analyzed the work before its submission. Those people who are reviewing the publication are always reputed experts specializing in the field. They read the work thoroughly, share their recommendations, and help authors make changes respectfully.<\/p>\n<p>The peer-reviewing process is rather exhausting and effort-consuming, meaning not all scholarly sources are peer-reviewed.<\/p>\n<p><strong>How to Understand If the Source Is Peer-Reviewed<\/strong><\/p>\n<p>If you want to figure out if the source is peer-reviewed, you need to have a look at the information about the journal.<\/p>\n<p><strong><u>Way #1.<\/u><\/strong><\/p>\n<ol>\n<li>Find this journal online;<\/li>\n<li>Visit the homepage of the journal and find the “About Us” or “Notes for Authors” tab. If you find the information saying that this journal is peer-reviewed, you can definitely use it as a source for your work.<\/li>\n<\/ol>\n<p>Tip: Use Ctrl+F looking for the word “peer” to make your search quick and efficient.<\/p>\n<p><strong><u>Way #2. <\/u><\/strong><\/p>\n<p>In case you are not able to find a website of the journal, you can try to do the following:<\/p>\n<ol>\n<li>Find the most recent issue addressed in the journal;<\/li>\n<li>Locate the masthead of the publication (the information about the publishers, editors, etc.). If it says that the periodical is peer-reviewed, you are free to use it as a source.<\/li>\n<\/ol>\n<p><strong><u>Way #3. <\/u><\/strong><\/p>\n<p>If you failed to find out if the source is peer-reviewed by using the previous two ways, you can try to do the following:<\/p>\n<ol>\n<li>Find the journal website and find the information about the article submission. If the author or authors submitted several copies of their articles, then the chances are high that the article is peer-reviewed;<\/li>\n<li>Moreover, you can look for common attributions of a peer-reviewed source:<\/li>\n<\/ol>\n<ul>\n<li>Abstract;<\/li>\n<li>A long title that includes specific and topic-related terms;<\/li>\n<li>List of authors and their credentials;<\/li>\n<li>Typical headings and subheadings (<em>introduction, literature overview, methodology, results, discussion, and a conclusion<\/em>);<\/li>\n<li>Technical terminology;<\/li>\n<li>Reference list.<\/li>\n<\/ul>\n<p>If the publication has all the attributes mentioned above and there are a couple of submission copies, then the article is probably peer-reviewed.<\/p>\n<p>Below, you will find a list of publications that are NOT peer-reviewed even if they are published in peer-reviewed journals:<\/p>\n<ul>\n<li>Opinion pieces;<\/li>\n<li>Book reviews;<\/li>\n<li>Letters to the editors;<\/li>\n<li>Editorials.<\/li>\n<\/ul>\n<p><strong>Sources That Are Not Peer-Reviewed<\/strong><\/p>\n<p><span style=\"text-decoration: underline;\"><strong>Website articles<\/strong><\/span><\/p>\n<p>Although some websites provide reliable content, they cannot be considered peer-reviewed sources;<\/p>\n<p><span style=\"text-decoration: underline;\"><strong>Newspaper and magazine articles <\/strong><\/span><\/p>\n<p>Even though editors review these publications before being published, they are not written by certified experts. Thus, they cannot be considered peer-reviewed.<\/p>\n<p><span style=\"text-decoration: underline;\"><strong>Books<\/strong><\/span><\/p>\n<p>Although they are considered reliable sources, they are not peer-reviewed. At the same time, some books published by reputed universities are peer-reviewed, though it is pretty difficult to understand which ones.<\/p>\n<p><span style=\"text-decoration: underline;\"><strong>Conference proceedings<\/strong><\/span><\/p>\n<p>Conference proceedings often appear in professional journals, though they are not peer-reviewed.<\/p>\n<h4 style=\"text-align: center;\"><strong>What Sources You Should Avoid<\/strong><\/h4>\n<p>Now, when you know all the main characteristics of appropriate academic sources, you should study what sources one should avoid. All the sources that are mentioned below lack credibility and, thus, cannot be used when writing your paper.<\/p>\n<p><strong>Wikipedia<\/strong><\/p>\n<p>Wikipedia cannot be considered a credible source because any person can edit its pages. It means that a person, who has no appropriate expertise and credentials, can add information on Wikipedia pages. Usually, professors emphasize that Wikipedia cannot be used as a source for the academic paper. However, even if they do not, you should know that using this source is forbidden by the rules of academic writing.<\/p>\n<p><strong>General Blogs and Websites<\/strong><\/p>\n<p>Typically, these websites publish articles that lack authority and credibility. Thus, they cannot serve as a useful source of information. Very often, websites publish articles to manipulate the public option, which means they are often biased and subjective.<\/p>\n<p><strong>Social Media Sites<\/strong><\/p>\n<p>Of course, you may find much information about the current issues on popular social media sites. However, you should know that such information usually lacks credibility, and you should not use it for your paper.<\/p>\n<p><strong>Outdated Materials<\/strong><\/p>\n<p>Even the best sources can be outdated. In the present-day world, various fields are developing very fast. Therefore, the information that was published in the sources more than ten years ago is no longer valid. Therefore, it is highly recommended to find academic sources that include the actual information. Such approach will not only grant a good grade but also prove your awareness of the current trends in the field.<\/p>\n<h4 style=\"text-align: center;\"><strong>How to Evaluate the Credibility of the Source<\/strong><\/h4>\n<p>It is particularly important to be able to understand what makes a source credible. Have a look at some suggestions that will help you figure out whether you can consider the source credible. Typically, a credible source is up-to-date, fact-based, and written by a specialist having the necessary expertise and background. For instance, you can use the sources that can be found on educational and government-run websites. The sources that are outdated or contain shallow information cannot be considered credible.<\/p>\n<p>We do hope that our suggestions will help you pick up the best sources for your paper. Keep in mind that no matter what source you use, you will need to include its bibliographical information in your paper. Otherwise, your work will appear plagiarized. When including all the sources you have used while working on your paper, you give credit to these authors. If you fail to do it, you can be accused of violation of the authorship rights, which is strictly punished in all educational institutions. All in all, we want you to know that the more papers you write, the better you will understand which sources are the most appropriate for them.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>When it comes to writing academic papers, it is important to use the most reliable sources. It will help you convince your audience that your arguments are valid and accurate. However, you should understand that using sources that lack credibility will significantly reduce your chances of getting a good grade. Therefore, if you want to&#8230;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[7],"tags":[63,426,430,434],"_links":{"self":[{"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/posts\/2522"}],"collection":[{"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/comments?post=2522"}],"version-history":[{"count":6,"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/posts\/2522\/revisions"}],"predecessor-version":[{"id":2574,"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/posts\/2522\/revisions\/2574"}],"wp:attachment":[{"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/media?parent=2522"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/categories?post=2522"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/tags?post=2522"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}