{"id":2582,"date":"2021-06-07T10:35:30","date_gmt":"2021-06-07T15:35:30","guid":{"rendered":"https:\/\/4writers.net\/blog\/?p=2582"},"modified":"2021-06-07T10:42:53","modified_gmt":"2021-06-07T15:42:53","slug":"the-importance-of-spelling-boost-your-writing-talent","status":"publish","type":"post","link":"https:\/\/4writers.net\/blog\/the-importance-of-spelling-boost-your-writing-talent\/","title":{"rendered":"The Importance of Spelling: Boost Your Writing Talent"},"content":{"rendered":"<p>Misspelling a word can seem a minor mistake. However, if there are a lot of typos in your paper, it will demonstrate your carelessness and negatively affect the result of your work. If the reader notices many misspelled words in your paper, they will assume that you did not care to proofread it. Moreover, it may be a sign that you do not know the etymology of the words you include in your paper. Either way, misspelled words will compromise your writer’s authority. Therefore, you need to spend some time <a href=\"https:\/\/4writers.net\/blog\/5-reasons-why-proofreading-is-a-necessary-component-of-academic-writing\/\">proofreading<\/a> your paper after finishing it.<\/p>\n<p><!--more--><\/p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-2586\" src=\"https:\/\/4writers.net\/blog\/wp-content\/uploads\/2021\/06\/Spelling.jpg\" alt=\"\" width=\"800\" height=\"533\" srcset=\"https:\/\/4writers.net\/blog\/wp-content\/uploads\/2021\/06\/Spelling.jpg 800w, https:\/\/4writers.net\/blog\/wp-content\/uploads\/2021\/06\/Spelling-300x200.jpg 300w, https:\/\/4writers.net\/blog\/wp-content\/uploads\/2021\/06\/Spelling-768x512.jpg 768w, https:\/\/4writers.net\/blog\/wp-content\/uploads\/2021\/06\/Spelling-275x183.jpg 275w\" sizes=\"(max-width: 800px) 100vw, 800px\" \/><\/p>\n<p>The best way to check if your paper is free from spelling errors is to search for them when proofreading your paper. To succeed at this stage, you need to be aware of common mistakes committed by writers habitually. In our guide, you will find a lot of handy tips and suggestions that will help you organize your proofreading process properly. By learning some important spelling rules, you will be able to prepare brilliant papers.<\/p>\n<h4 style=\"text-align: center;\"><strong>Covid-19 or COVID-19: Which Spelling Is Correct?<\/strong><\/h4>\n<p>In the present-day realms, this question is very relevant. When you are writing a paper about this disease, you need to use “COVID-19” or “coronavirus disease.”<\/p>\n<p>Coronavirus disease or COVID-19 are the official names formulated by the World Health Organization. At the same time, in many publications, one can also find the spelling “Covid-19.” As The Guardian’s experts explain it, a lot of article writers use uppercase for abbreviations that are pronounced as a collection of letters. With time, acronyms can be pronounced as words so that we can notice Unicef, Nasa, and now, Covid-19.<\/p>\n<p>In some dictionaries such as Merriam-Webster or Oxford Learner’s dictionary, one can see that Covid-19 is used as an alternative to COVID-19. Consequently, one can assume that “Covid-19 vs. COVID-19” will become a subject for further linguistic debates.<\/p>\n<p>At the same time, it is worth saying that the WHO accepts only one version, “COVID-19.” Nevertheless, when you see “Covid-19” in newspapers, there is no need to correct it because many reputed sources use this version. Therefore, one can conclude that both options are correct.<\/p>\n<h4 style=\"text-align: center;\"><strong>How to Improve Spelling: Efficient Tools<\/strong><\/h4>\n<h5><span style=\"font-size: 12pt;\"><strong>Use a trusted dictionary<\/strong><\/span><\/h5>\n<p>Even if you are a good writer, you cannot rely solely on the ability of your brain to memorize difficult-to-spell words. To spell your words correctly, you need to look for a good and up-to-date dictionary. Although there are many dictionaries available, both print and online versions, you need to use the best one. You need to always follow the rules applicable to specific spelling conventions (for example, UK or US spelling) and consult with a dictionary offering this spelling. Whenever you need to use Canadian spelling in your paper, you need to find a dictionary that provides Canadian spellings.<\/p>\n<p>Non-native speakers can take advantage of using <a href=\"https:\/\/www.oxfordlearnersdictionaries.com\/\"><em>Oxford<\/em> <\/a><em>Advanced Learner’s Dictionary<\/em> or <a href=\"https:\/\/www.ldoceonline.com\/\"><em>Longman<\/em> <em>Dictionary of Contemporary English<\/em><\/a><em>,<\/em> as they contain useful information about the context, which requires specific words. Consequently, they help to understand which words are more appropriate in various situations.<\/p>\n<h5><span style=\"font-size: 12pt;\"><strong>Be consistent about your spelling<\/strong><\/span><\/h5>\n<p>Whenever you use American, British, or Canadian spelling in your paper, you should be consistent in doing it. Whereas Canadians often prefer the British <em><strong>–our<\/strong><\/em> ending in words like <em>colour <\/em>or <em>harbour<\/em>, the American <em><strong>–or<\/strong><\/em> endings can also be used. The same rule is applied to the <strong>–<\/strong><em><strong>re<\/strong><\/em><strong>\/-<\/strong><em><strong>er<\/strong><\/em><strong><em> <\/em><\/strong>endings, for example, <em>theatre\/theater<\/em> or <em>centre\/center<\/em>. Canadian spelling prefers the British <strong><em>–re<\/em><\/strong> ending, though American <strong><em>–er <\/em><\/strong>ending is also acceptable. At the same time, Canadians use the American convention of using <strong><em>–<\/em><\/strong><em><strong>ize<\/strong><\/em><strong><em> <\/em><\/strong>ending instead of –-<em><strong>ise<\/strong><\/em><strong> <\/strong>ending for words like <em>hypothesize <\/em><em>or<\/em><em> scrutinize<\/em>, though the <strong>–<\/strong><em><strong>ise<\/strong><\/em> ending is also acceptable. If you want to make your audience enjoy reading your paper, you need to be consistent about the spelling you use. This means that you should not combine the <strong><em>–our <\/em><\/strong>and <strong><em>–or <\/em><\/strong>or <strong><em>–ise <\/em><\/strong>and <strong><em>–ize <\/em><\/strong>endings in your paper.<\/p>\n<p><strong><u>Useful tip:<\/u><\/strong><\/p>\n<p>When you add suffixes to words ending in <strong><em>–our<\/em><\/strong>, it is necessary to drop the <em>u<\/em>: not <em>humourous <\/em>but<em> humorous<\/em>, not <em>honourary <\/em>but<em> honorary<\/em>.<\/p>\n<h5><span style=\"font-size: 12pt;\"><strong>Make sure to pay attention to “troublesome” suffixes<\/strong><\/span><\/h5>\n<p>There are some suffixes in the English language that confuse the most skilled writers. If you have any doubts regarding the suffixes that you should use in your paper, you need to check them when editing your work.<\/p>\n<ul>\n<li>-ible or -able (-ibility or -ability, -ibly or -ably): reliable \/ responsible, reliably \/ responsibly; reliability \/ responsibility;<\/li>\n<li>-ance or -ence or:  <em>importance<\/em><em>\/ <\/em><em>dependence;<\/em><\/li>\n<li>-cial or -tial: beneficial \/ partial.<\/li>\n<\/ul>\n<h5><span style=\"font-size: 12pt;\"><strong>Pay attention to homophones and other confusable words<\/strong><\/span><\/h5>\n<p>You probably know that a lot of English words have different spelling but similar pronunciations. If you utilize the inappropriate word from a homophone pair, you will commit the most common spelling mistake. Therefore, to improve your writing proficiency, you need to check the common types of typically misspelled words when proofreading your paper:<\/p>\n<p><strong><em>For example:<\/em><\/strong><\/p>\n<ul>\n<li>Proceed\/precede;<\/li>\n<li>Except\/accept;<\/li>\n<li>Here\/hear;<\/li>\n<li>Which\/witch.<\/li>\n<\/ul>\n<h5><span style=\"font-size: 12pt;\"><strong>Use your computer spell checker, but do not rely solely on the software<\/strong><\/span><\/h5>\n<p>Of course, you can use your computer spell-checking software as a tool for noticing spelling mistakes. It will help you catch any words or word combinations that are not natural for the English language. However, we strongly recommend you not to rely on this software too much because it can miss a lot of misspelled words that form another English word, for example <em>whose<\/em> instead of <em>who’s<\/em>.<\/p>\n<p>If you rely on your automatic spell-checking tool, you can become inattentive to spelling mistakes when you write your paper and edit it. As a result, you will find it too difficult to recognize correct spelling.<\/p>\n<p>Instead of using the automatic spell-checking software, you should develop your writing intuition. For example, you can turn your spell-checker off and try to revise your paper without it. Then, you may need to turn it on and compare the results. By using this strategy regularly, you will pay attention to the mistakes you tend to commit habitually, which will increase your chances of producing high-quality papers.<\/p>\n<h5><span style=\"font-size: 12pt;\"><strong>Learn common English spelling rules<\/strong><\/span><\/h5>\n<p>You should know that English spelling usually follows certain rules. If you want to succeed in academic writing, you need to be aware of these rules. This skill will help you avoid numerous mistakes. If you check common guides, you will see that they contain lists of spelling rules. Below, you will find the ones that will help you achieve the best results:<\/p>\n<p><em><strong>Rule 1<\/strong>: <\/em> <em>When you add suffixes that begin with a vowel<\/em><em> (<\/em><em>–<\/em><em>ible<\/em><em>, <\/em><em>-able,<\/em><em> –<\/em><em>ous<\/em><em>, etc<\/em><em>.) <\/em><em>to having silent<\/em><em> <strong>e<\/strong><\/em> at their end<em>, you need to omit the final<\/em><em> <strong>e<\/strong>.<\/em><\/p>\n<p>This rule helps figure out why a word like <em>desire <\/em>has an <em><strong>e<\/strong><\/em> whereas a word <em>desirable<\/em> has not. As for other examples, one should mention <em>continue <\/em>&#8211; <em>continuous, response &#8211;<\/em> <em>responsible<\/em>.<br \/>\nHowever, it is necessary to retain the final <em><strong>e<\/strong> <\/em>when a word ends in–<em>ge or <\/em>–<em>ce <\/em>to maintain the clear pronunciation of these consonants:<\/p>\n<p><em>courage <\/em>&#8211; <em>courageous, notice <\/em>&#8211; <em>noticeable<\/em>.<\/p>\n<p><em><strong>Rule 2<\/strong>:<\/em> <em><strong>I<\/strong><\/em> <em>before<\/em><em> <strong>e<\/strong><\/em> (<em>except after<\/em><em> <strong>c<\/strong>) or when sounded like <strong>ay<\/strong><\/em><em>.<\/em><\/p>\n<p>This rule explains the difference between the spellings of <em>receive<\/em> <em>and believe<\/em>. In general, when the long <em><strong>e<\/strong><\/em> sounds <em><strong>ee<\/strong><\/em><em>, it<\/em> is spelled with the letters <em><strong>i<\/strong><\/em><strong><em> <\/em><\/strong>and <em><strong>e<\/strong><\/em>, the order is <em><strong>ie<\/strong><\/em>: <em>field, shield<\/em>. Common exceptions are <em>seizure, leisure,<\/em> and <em>weird<\/em>.<\/p>\n<p><em><strong>Rule 3<\/strong>:<\/em> <em>When you add suffixes to words ending in <strong>y<\/strong>, you need to substitute the <strong>y<\/strong> with an<\/em><em> <strong>i<\/strong>.<\/em><\/p>\n<p>This rule helps understand the shift of spelling that occurs in the following word combinations: <em>body <\/em>&#8211; <em>bod<\/em><strong><em>i<\/em><\/strong><em>ly <\/em><em>or happy <\/em>&#8211; <em>happ<\/em><strong><em>i<\/em><\/strong><em>er<\/em>.<\/p>\n<p>One should note that English spelling does not allow using an <em><strong>i<\/strong> <\/em>to follow another<strong> <em>i<\/em><\/strong>; thus, one should retain the <em><strong>y<\/strong><\/em> when the suffix itself begins with an <em><strong>i<\/strong><\/em>: <em>carry <\/em>&#8211; <em>carrying<\/em>.<\/p>\n<p><em><strong>Rule 4<\/strong>:<\/em> <em>When you add suffixes, you need to double the final consonant of a word in case any of the conditions mentioned below apply.<\/em><\/p>\n<ul>\n<li>The word has one syllable or the last syllable is stressed: <em>prefer <\/em>&#8211; <em>preferred, fit <\/em>&#8211; <em>fitted<\/em>. If the stress does not fall on the last syllable, the consonant will not be doubled: <em>offer &#8211;<\/em> <em>offered<\/em>;<\/li>\n<li>A single vowel precedes the final consonant: <em>bar <\/em>&#8211; <em>barred<\/em>. When there are a couple of vowels before the final consonant in a word, the consonant is never doubled: <em>fail <\/em>&#8211; <em>failed<\/em>.<\/li>\n<li>In case the word ends in <em><strong>p<\/strong> <\/em>or <em><strong>l<\/strong><\/em>, then the consonant is often doubled in Canadian spelling: <em>travel <\/em>&#8211; <em>travelled<\/em>. Pay attention that the American spelling does not follow this rule.<\/li>\n<\/ul>\n<p>All in all, we want you to know that there are many ways to improve spelling in your paper. By following our handy suggestions, you will be able to eliminate spelling mistakes affecting the quality of your paper. So, if you want to prepare flawless texts and get good grades for them, read this guide attentively.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Misspelling a word can seem a minor mistake. However, if there are a lot of typos in your paper, it will demonstrate your carelessness and negatively affect the result of your work. If the reader notices many misspelled words in your paper, they will assume that you did not care to proofread it. Moreover, it&#8230;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[7],"tags":[458,462,446,450,454],"_links":{"self":[{"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/posts\/2582"}],"collection":[{"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/comments?post=2582"}],"version-history":[{"count":6,"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/posts\/2582\/revisions"}],"predecessor-version":[{"id":2610,"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/posts\/2582\/revisions\/2610"}],"wp:attachment":[{"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/media?parent=2582"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/categories?post=2582"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/tags?post=2582"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}