{"id":785,"date":"2009-08-05T12:31:50","date_gmt":"2009-08-05T17:31:50","guid":{"rendered":"http:\/\/4writers.xp\/blog\/getting_the_hang_of_your_freelance_writing_career\/"},"modified":"2009-08-05T12:31:50","modified_gmt":"2009-08-05T17:31:50","slug":"getting_the_hang_of_your_freelance_writing_career","status":"publish","type":"post","link":"https:\/\/4writers.net\/blog\/getting_the_hang_of_your_freelance_writing_career\/","title":{"rendered":"Getting the Hang of Your Freelance Writing Career"},"content":{"rendered":"<p>When you begin your job as a freelance writer, you will be the only one who is in charge of managing your career. The same is not true when your work for another employer. Of course, you manage to be your own person but you have to go with what your company has to say about you and the things you do. They determine as much as how you advance and many more.<\/p>\n<p>Here are three ways by which you can successfully manage your freelancing career:<\/p>\n<p>1. First, you have to be prepared for the good and bad things. A few freelance writers just want to have all fun, games, and a lot of income day after day. This is not how things should be. Just like all other kinds of career, some days will be good while some days will be bad. You have to be certain that you are fully prepared to face both of these things.<\/p>\n<p>2. Also, you should not forget about the things that are bothering you. The easiest way to solve a problem is not to put it aside and hope for the best that it does not get any worse. You should really avoid this mistake. What you should do to become a very successful freelance writer is to be ready with any kinds of problem, no matter how big or small they are.<\/p>\n<p>3. It is also important to stay very organized. When I was still a newbie in my career, I was not as organized as I could have possibly been. This then led to a lot of mishaps which included failed deadlines and errors in accounting. Fortunately, I saw how important it was to organize all my thoughts, even though sometimes it meant sacrificing some of my time. Good organization should be made a habit. Once you jive with the flow, you will begin to stay organized because of its advantages.<\/p>\n<p>It would be very impossible for me to sit down and cite all the ways to have a good management of a freelance writing career. Of course, people have different ways of addressing things. All else aside, those three things I mentioned have really helped me over the years; it should help you out as well.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>When you begin your job as a freelance writer, you will be the only one who is in charge of managing your career. The same is not true when your work for another employer. Of course, you manage to be your own person but you have to go with what your company has to say&#8230;<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[10,14,15,21,23],"_links":{"self":[{"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/posts\/785"}],"collection":[{"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/comments?post=785"}],"version-history":[{"count":0,"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/posts\/785\/revisions"}],"wp:attachment":[{"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/media?parent=785"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/categories?post=785"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/tags?post=785"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}