{"id":787,"date":"2009-09-14T17:53:29","date_gmt":"2009-09-14T22:53:29","guid":{"rendered":"http:\/\/4writers.xp\/blog\/qualities_of_a_successful_freelance_writer\/"},"modified":"2009-09-14T17:53:29","modified_gmt":"2009-09-14T22:53:29","slug":"qualities_of_a_successful_freelance_writer","status":"publish","type":"post","link":"https:\/\/4writers.net\/blog\/qualities_of_a_successful_freelance_writer\/","title":{"rendered":"Qualities of a Successful Freelance Writer"},"content":{"rendered":"<p>Just like all other career paths, it is hard to specify what exactly determines a good freelance writer. There are a few people who have a lot of success without necessarily going with the common path. There are other people who never earn as much as they can even if they feel that their performance is at the maximum. There is actually one thing that you would not wand to disregard, and that is the meaning of the word success. Until you have a clear definition of what success truly is, it would be very hard for you to see if you have reached your goals or not.<\/p>\n<p>For me, there are many ways of describing success. Of course, the way I interpret this is not necessarily true for everyone; it is my own personal opinion. The most valuable thing for me in freelance writing is that I enjoy my job. Back when I was with my full-time job as a sales manager, every single day was full of monotony and boredom. In occasional times, there would be some fun. But for the most time, I really did hate my job. However, the moment I finally began working as a freelance writer, I immediately knew that I was on the right track. For one thing, if you do not enjoy and have fun being a freelance writer, then it would be very hard for you to get any kind of success.<\/p>\n<p>How about money? A lot of people, including myself, see money as an important determinant that indicates success. You should be happy and proud of the amount of money that you earn, but it is definitely not something to obsess about. No two freelance writers will ever earn the same amount of money. Some people may see a thousand dollars a big success, while some people would want a whole lot more than this. As long as your goals are there and set, it would be easy to monitor your failures and victories.<\/p>\n<p>As a freelance writer, you have to determine the factors which make up success. As with every single aspect of your career, it would be up to you and your control.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Just like all other career paths, it is hard to specify what exactly determines a good freelance writer. There are a few people who have a lot of success without necessarily going with the common path. There are other people who never earn as much as they can even if they feel that their performance&#8230;<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[10,14,15,20,21,23],"_links":{"self":[{"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/posts\/787"}],"collection":[{"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/comments?post=787"}],"version-history":[{"count":0,"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/posts\/787\/revisions"}],"wp:attachment":[{"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/media?parent=787"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/categories?post=787"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/tags?post=787"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}