{"id":789,"date":"2009-10-25T11:38:59","date_gmt":"2009-10-25T16:38:59","guid":{"rendered":"http:\/\/4writers.xp\/blog\/taking_pleasure_from_a_freelance_writing_project\/"},"modified":"2009-10-25T11:38:59","modified_gmt":"2009-10-25T16:38:59","slug":"taking_pleasure_from_a_freelance_writing_project","status":"publish","type":"post","link":"https:\/\/4writers.net\/blog\/taking_pleasure_from_a_freelance_writing_project\/","title":{"rendered":"Taking Pleasure from a Freelance Writing Project"},"content":{"rendered":"<p>I often ask members of my freelance writing course about the kind of freelance writing projects that they enjoy the most. And I can see that they are already tired of being asked by this monotonous question. Definitely it is too much but it is very important to ask this question at least once a week and answer this for several times. One good reason why I always ask this question is because of the fact that nothing is more important than the topics that they enjoy so that they can focus more. Another advantage is that once you have focus on your topic, there is no reason that you will not be able to create a good article.<\/p>\n<p>Any type of project will work on you since every freelance writer is unique. If you want to know the kind of project that you will surely enjoy, then try this exercise. You need to jot down all the types of project you have done for the past few months. From there, rate the projects you wanted ranging from one to ten, making ten as the most enjoyable project you have done. With this kind of exercise, you will determine the projects you enjoy, do not like or just those in the middle. However, this does not give you an idea that you will only accept projects you like. This is what beginners should bear in mind.<\/p>\n<p>As for beginners, you have to get a lot of experience in a number of ways while you are on your way building your career. Besides, you will never know whether you like a project or not if you will not try everything. In short, you do not have any point of comparison. Nothing is wrong in venturing into other things. It is also a good example to enhance your versatility as a freelance writer. For sure you can produce clients that offer you good projects that you will definitely enjoy. Not only that, you will also have a profitable income.<\/p>\n<p>If you still cannot identify the project you enjoy, then try to figure out as early as now for you to have a proper direction in your career path.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>I often ask members of my freelance writing course about the kind of freelance writing projects that they enjoy the most. And I can see that they are already tired of being asked by this monotonous question. Definitely it is too much but it is very important to ask this question at least once a&#8230;<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[8,10,11,14,21,23],"_links":{"self":[{"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/posts\/789"}],"collection":[{"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/comments?post=789"}],"version-history":[{"count":0,"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/posts\/789\/revisions"}],"wp:attachment":[{"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/media?parent=789"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/categories?post=789"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/tags?post=789"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}