{"id":808,"date":"2007-11-18T23:50:52","date_gmt":"2007-11-19T04:50:52","guid":{"rendered":"http:\/\/4writers.xp\/blog\/p_ignore_doubts_to_achieve_success_p\/"},"modified":"2016-10-21T07:06:56","modified_gmt":"2016-10-21T12:06:56","slug":"p_ignore_doubts_to_achieve_success_p","status":"publish","type":"post","link":"https:\/\/4writers.net\/blog\/p_ignore_doubts_to_achieve_success_p\/","title":{"rendered":"Ignore doubts to achieve success"},"content":{"rendered":"<p>Most of the people have a lot of doubts about the freelance writing when they pursue as their carrier. You will be able to see this if you search on the internet that most of the people who are pursuing freelance writing as their carrier has lot of doubts about themselves and their abilty to succeed in freelance writing. This is quite natural for any people in their start of their carrier as they will not have any idea as whet they will be able to do. You will be able to succeed only when you overcome these doubters that are present within you as these act as an obstacle for you to succeed. Confidence is one of the essential things that you need to have as a freelancer. If you are lacking confidence then this will act as a great hindrance or you to achieve success. The only way you will be able to overcome this is by ignoring all the negative thoughts that you have in your mind.<\/p>\n<h2>Here are some of the common reasons why people get doubts<\/h2>\n<p>1)      Most of the people will think that whether they will be able to make enough money by pursing freelance writing as their carrier. Some people believe that when you are self employed other people consider you as unemployed. If any people around you are saying like this, then it is really not true. It just implies that they are jealous on your progress that you make, so better ignore their speech and start working for your growth.<\/p>\n<p>2)      There is lot of competition that is present in the market and whether you will be able to succeed with the completion that is prevailing. You need to think that you will be able to succeed as only when you have the confidence on yourself you will be able to succeed as confidence is one of the important factors that you need to have when you are working as a freelancer writer.<\/p>\n<p>You will be able to achieve success if you just ignore all this doubts that you have in your mind and then simply work towards your goal.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Most of the people have a lot of doubts about the freelance writing when they pursue as their carrier. You will be able to see this if you search on the internet that most of the people who are pursuing freelance writing as their carrier has lot of doubts about themselves and their abilty to&#8230;<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[3],"tags":[14,20,21,22,23],"_links":{"self":[{"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/posts\/808"}],"collection":[{"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/comments?post=808"}],"version-history":[{"count":1,"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/posts\/808\/revisions"}],"predecessor-version":[{"id":1013,"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/posts\/808\/revisions\/1013"}],"wp:attachment":[{"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/media?parent=808"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/categories?post=808"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/tags?post=808"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}