{"id":815,"date":"2008-11-27T02:36:53","date_gmt":"2008-11-27T07:36:53","guid":{"rendered":"http:\/\/4writers.xp\/blog\/becoming_a_full-time_freelance_writer_from_being_part-time\/"},"modified":"2008-11-27T02:36:53","modified_gmt":"2008-11-27T07:36:53","slug":"becoming_a_full-time_freelance_writer_from_being_part-time","status":"publish","type":"post","link":"https:\/\/4writers.net\/blog\/becoming_a_full-time_freelance_writer_from_being_part-time\/","title":{"rendered":"Becoming a Full-time Freelance Writer from being Part-time"},"content":{"rendered":"<p>There are a lot of freelance writers who may be doing it part-time but, are already thinking about doing it full-time. If you are one of these, then this would surely be a major transition that you are about to experience. However, if you truly feel that you are now ready for this kind of undertaking, then it is a must to immediately do so instead of prolonging this transition.<\/p>\n<p>You just have to take these three simple tips into account so that this transition would become more meaningful and worth remembering:<\/p>\n<p>1.\tYou should be aware of what you are going to do and what you are about to do. When you decide to work as a full-time freelance writer, it would be different from working part-time. Also, you should be prepared to work longer, and that you may become busy. If for instance you have no other source of income besides this, you should immediately try to move to being a full-time writer immediately.<br \/>\n2.\tYou should first be able to answer all possible questions that are running through your mind before you make any decision to go full-time. A freelance writer may have a set of various questions different from another writer. There are those who are curious about how they would be able to appropriately market once they become a full-time writer. Aside from this, there are also those writers who are interested to know about the number of hours that needs to be devoted. The answers are to be found by simply exploring your surroundings and what are the available sources for your answers.<br \/>\n3.\tGo straight ahead. There are writers who are still afraid of this kind of decision in the sense that they beat around it and in the end, do not actually end up getting there. You should know within you that you are prepared and indeed ready for this kind of transition. When do not go ahead and dive in, it would be difficult for you to actually achieve the goals that you have just because you became afraid to really go through this transition and you may  not be confident about yourself.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>There are a lot of freelance writers who may be doing it part-time but, are already thinking about doing it full-time. If you are one of these, then this would surely be a major transition that you are about to experience. However, if you truly feel that you are now ready for this kind of&#8230;<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[3],"tags":[13,21,22],"_links":{"self":[{"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/posts\/815"}],"collection":[{"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/comments?post=815"}],"version-history":[{"count":0,"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/posts\/815\/revisions"}],"wp:attachment":[{"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/media?parent=815"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/categories?post=815"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/tags?post=815"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}