{"id":819,"date":"2009-05-03T09:16:33","date_gmt":"2009-05-03T14:16:33","guid":{"rendered":"http:\/\/4writers.xp\/blog\/my_freelance_writing_journey\/"},"modified":"2009-05-03T09:16:33","modified_gmt":"2009-05-03T14:16:33","slug":"my_freelance_writing_journey","status":"publish","type":"post","link":"https:\/\/4writers.net\/blog\/my_freelance_writing_journey\/","title":{"rendered":"My Freelance Writing Journey"},"content":{"rendered":"<p>It took me a long time for me to say that my freelance writing career is the best decision that I made in my entire life. A lot of reasons brought me into my freelance writing career and I can say that everything I have done in the previous years was worth it. But for new freelance writers that I once was, entering this kind of career is full of uncertainties. Of course you cannot deny the fact that you are still on your way building your career path.<\/p>\n<p>There are three reasons that brought me into freelance writing. First, I wanted things to go my way. In other words, I am the boss. For how many years of working with and for other people, it made me realize that I can do things better alone. When you are involved in a freelance writing work, you have the privilege to manipulate things. You are in charge of everything. Though it is such a huge responsibility, this thing is very fulfilling and makes me feel great. Second, I got a degree in Journalism that taught me to write and write for many years. And because of this, I am certain that I have been molded to excel in this field.  And the last reason is all about freedom. For me, nothing is more important than freedom in every work. I can attest that freedom is the best thing that happened to me from being a freelance writer besides money. I can work, take a break, and decide any time whenever I want to. And for this reason, I strongly believe that freedom is more essential than money. These three reasons made the determined and fulfilled freelance writer that I am right now.<\/p>\n<p>Apparently, I get involved with this job not for money but because of the things I wanted to work with my way. Though having this job gave me a decent income, this was not basically the main reason because for as long as I am able to pay the things I need, that would be just fine.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>It took me a long time for me to say that my freelance writing career is the best decision that I made in my entire life. A lot of reasons brought me into my freelance writing career and I can say that everything I have done in the previous years was worth it. But for&#8230;<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[3],"tags":[10,14,15,23],"_links":{"self":[{"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/posts\/819"}],"collection":[{"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/comments?post=819"}],"version-history":[{"count":0,"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/posts\/819\/revisions"}],"wp:attachment":[{"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/media?parent=819"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/categories?post=819"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/tags?post=819"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}