{"id":915,"date":"2017-06-14T08:48:17","date_gmt":"2017-06-14T13:48:17","guid":{"rendered":"http:\/\/4writers.net\/blog\/?p=915"},"modified":"2017-06-15T02:15:34","modified_gmt":"2017-06-15T07:15:34","slug":"challenges-writers-face-while-writing","status":"publish","type":"post","link":"https:\/\/4writers.net\/blog\/challenges-writers-face-while-writing\/","title":{"rendered":"Challenges Writers Face while Writing"},"content":{"rendered":"<p>When you work in a sphere of freelance writing, you are an independent person that does not really have a boss. You get the instructions and all you need to do is follow them carefully applying everything you know on the subject. The task seems easy, however, it is not always so. A freelance writer’s job has many advantages, but it has some negative sides too. Here is a brief description of major writing challenges that a freelancer faces and tips for overcoming them.<!--more--><\/p>\n<p><img loading=\"lazy\" class=\"size-full wp-image-916 aligncenter\" src=\"http:\/\/4writers.net\/blog\/wp-content\/uploads\/2016\/09\/Challenges-Writers-Face-while-Writing.jpg\" alt=\"4writers.net_challenges-writers-face-while-writing\" width=\"800\" height=\"600\" srcset=\"https:\/\/4writers.net\/blog\/wp-content\/uploads\/2016\/09\/Challenges-Writers-Face-while-Writing.jpg 800w, https:\/\/4writers.net\/blog\/wp-content\/uploads\/2016\/09\/Challenges-Writers-Face-while-Writing-300x225.jpg 300w, https:\/\/4writers.net\/blog\/wp-content\/uploads\/2016\/09\/Challenges-Writers-Face-while-Writing-768x576.jpg 768w, https:\/\/4writers.net\/blog\/wp-content\/uploads\/2016\/09\/Challenges-Writers-Face-while-Writing-267x200.jpg 267w\" sizes=\"(max-width: 800px) 100vw, 800px\" \/><\/p>\n<h4>1.      Writer’s block<\/h4>\n<p>Every freelance writer has encountered this problem for at least once in his\/her life. It is hard to describe as everyone has his\/her personal “symptoms” of this condition. If you do not feel like writing, would be glad to do anything else, and are not sure when you will have the mood for writing, you definitely have a writer’s block. To solve this issue, you need:<\/p>\n<p>a)      have a good sleep<\/p>\n<p>b)      take some rest from writing<\/p>\n<p>c)      go in for sports<\/p>\n<p>d)      keep on reading<\/p>\n<h4>2.      Lack of ideas<\/h4>\n<p>It often happens that a writer knows he\/she can definitely write the paper, but does not know where to start and what to write about. It can happen to everyone. If you are uncommonly absent-minded the day you write or, on the contrary, feel too stressed about producing the article, you might have lack of ideas. Each case needs its own way out. If you are not focused, you can watch or read something good that inspires you for a little while and then start exploring the topic. If you think too much of writing an essay or any other paper you need to write, get distracted. Observe the nature, listen to music, watch or read something. Just make sure it does not take much time to avoid getting additional stress because of upcoming deadline.<\/p>\n<h4>3.      Being unconfident<\/h4>\n<p>I often hear that inexperience writers complain that they do not feel they are knowledgeable enough to write something. If you think the same way, you can give it up if you want, but I am certain that everyone can write; the only thing needed is to get it started. Do not be afraid to take a chance. No one will kill you for using a wrong expression. No one will make you to go on if you do not like writing. And finally, you will never know whether you can do it, if you never try. Remember that experience, positive attitude and constant development contribute to self-confidence, so write and learn more and develop a positive thinking.<\/p>\n<h4>4. Isolation<\/h4>\n<p>If you are a self-employed freelance writer and do not have any other additional job, you might feel isolated. Since you do not need to come to the office every day, you do not leave your apartment without any need. You might not feel lonely, but being along for much time will definitely make you feel isolated from the rest of the world. In order to get rid of this unpleasant feeling, you need to reconsider your lifestyle. Introduce several rules to your life:<\/p>\n<p>a)      go out somewhere with a friend at least once in a week<\/p>\n<p>b)      set timeframes for work<\/p>\n<p>c)      exercise regularly<\/p>\n<p>d)      keep track of news<\/p>\n<h4>5. Lack of rest<\/h4>\n<p>Being focused on the work most of the time, one soon bets tired. As a freelancer, you become exhausted even sooner as you usually work longer hours than regular employees do. Lack of rest becomes another challenge that will prevent you from producing high-quality papers in short terms. Your productivity will definitely decrease if you do not have enough rest. The solution is easy: change your lifestyle. Adhere to the recommendations given to fight isolation – they will help you.<\/p>\n<p>Writing challenges are not limited to the five ones I have described above, but there is no obstacle one cannot overcome if he\/she wants. Do not be afraid of difficulties – if you really want, you can leave them behind in no time. Just remember: you can do it. Everyone can write, so pluck up your courage, do what you have to and enjoy doing it!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>When you work in a sphere of freelance writing, you are an independent person that does not really have a boss. You get the instructions and all you need to do is follow them carefully applying everything you know on the subject. The task seems easy, however, it is not always so. A freelance writer’s&#8230;<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[4,7],"tags":[28,24],"_links":{"self":[{"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/posts\/915"}],"collection":[{"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/comments?post=915"}],"version-history":[{"count":2,"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/posts\/915\/revisions"}],"predecessor-version":[{"id":1029,"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/posts\/915\/revisions\/1029"}],"wp:attachment":[{"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/media?parent=915"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/categories?post=915"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/4writers.net\/blog\/wp-json\/wp\/v2\/tags?post=915"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}